/* mountefiController */
"%@ APFS Container [%@]" = "%1$@ APFS容器 [%2$@]";

/* mountefiController */
"%lu partitions" = "%lu 個分區";

/* sidebarMenu */
"ACPI" = "ACPI-ACPI設定";

/* No comment provided by engineer. */
"B/s" = "B/s";

/* startScreen */
"Backup Configurations" = "備份設定值";

/* sectionSourceListHexConverterPopover */
"base64 string" = "base64字串";

/* sidebarMenu */
"Booter" = "Booter-啟動設定";

/* opencoreDownloaderController reading_savingOperation */
"Cancel" = "取消";

/* mountefiController */
"Capacity In Use:" = "使用容量:";

/* kextsInstallerController */
"Check" = "檢查中...";

/* mountefiController */
"Check Partition" = "檢查分區";

/* startScreen */
"Configurations Acquired" = "取得相同的設定值";

/* pasteBoardController */
"Copy" = "複製";

/* AFNetworking */
"Could not decode string: %@" = "不能解碼字串: %@";

/* pasteBoardController */
"Cut" = "剪下";

/* AFNetworking */
"Data failed decoding as a UTF-8 string" = "資料無法解碼為 UTF-8 字串";

/* No comment provided by engineer. */
"Day" = "天";

/* No comment provided by engineer. */
"Days" = "天";

/* sectionSourceListHexConverterPopover */
"decimal string" = "10進制字串";

/* kextsInstallerController */
"Delete: %@ successfully removed" = "刪除: %@ 已成功刪除";

/* installDriversController */
"Delete: %@.efi successfully removed" = "刪除: %@.efi 已成功刪除";

/* mountefiController */
"Device BSD Name:" = "設備 BSD 名稱:";

/* mountefiController */
"Device BSD Name: %@" = "設備 BSD 名稱: %@";

/* mountefiController */
"Device BSD Name: N/A" = "設備 BSD 名稱:N/A";

/* mountefiController */
"Device Identifier: %@ - APFS Physical Store Disk: %@ - UUID: %@ - Size: %@" = "設備辨識代號: %1$@ - APFS實體儲存硬碟: %2$@ - UUID: %3$@ - 容量: %4$@";

/* mountefiController */
"Device Identifier: %@ - Partition Scheme: %@ - Size: %@" = "設備辨識代號: %1$@ - 分區格式: %2$@ - 容量: %3$@";

/* sidebarMenu */
"DeviceProperties" = "DeviceProperties-設備屬性設定";

/* mountefiController */
"Devices / Media Name:" = "設備 / 詳細型號:";

/* mountefiController */
"Devices / Media Name: %@" = "設備 / 詳細型號: %@";

/* mountefiController */
"Disk Identifier:" = "磁區代號:";

/* mountefiController */
"Disk Identifier: %@ Status: [Current Boot Disk]" = "磁區代號: %@ 狀態: [當前引導硬碟]";

/* mountefiController */
"Disk Type:" = "硬碟類型:";

/* mountefiController */
"Disk Type: %@" = "硬碟類型: %@";

/* mountefiController */
"Disk Type: APFS Container" = "硬碟類型:APFS容器";

/* mountefiController */
"Disk Type: APFS Volume" = "硬碟類型:: APFS 資料卷宗";

/* mountefiController */
"Disk Type: Apple HFS+" = "硬碟類型:: Apple HFS+";

/* mountefiController */
"Disk Type: N/A" = "硬碟類型:: N/A";

/* mountefiController */
"Disk Type: SoftRAID Cache" = "硬碟類型:: SoftRAID Cache";

/* mountefiController */
"Disk Type: SoftRAID Scratch" = "硬碟類型: SoftRAID Scratch";

/* mountefiController */
"Disk Type: SoftRAID Status" = "硬碟類型:SoftRAID Status";

/* mountefiController */
"Disk Type: SoftRAID Volume" = "硬碟類型: SoftRAID Volume";

/* mountefiController */
"Disk UUID:" = "硬碟 UUID:";

/* mountefiController */
"Disk UUID: %@" = "硬碟 UUID:%@";

/* mountefiController */
"Disk UUID: N/A" = "硬碟 UUID:N/A";

/* installDriversController
   kextsInstallerController
   opencoreDownloaderController */
"Download" = "下載";

/* installDriversController
   kextsInstallerController */
"Download: %@ has been successfully copied to %@" = "下載: %1$@ 已成功複製到 %2$@";

/* installDriversController
   kextsInstallerController */
"Download: %@ has been successfully updated to %@" = "下載: %1$@ 已成功更新至%2$@";

/* kextsInstallerController */
"Download: %@ successfully backed up to %@" = "下載: %1$@ 成功備份到 %2$@";

/* installDriversController
   kextsInstallerController */
"Download: %@ successfully downloaded...." = "下載: %@成功下載....";

/* installDriversController
   kextsInstallerController */
"Download: Error: %@" = "下載: 錯誤: %@";

/* kextsInstallerController */
"Download: ERROR: %@" = "下載: 錯誤: %@";

/* installDriversController
   kextsInstallerController */
"Download: ERROR: You don't have permission to write here!" = "下載: 錯誤: 你沒有在這裡進行寫入的權限!";

/* installDriversController
   kextsInstallerController */
"Download: Path doesn't exist!" = "下載:路徑不存在!";

/* installDriversController */
"Download: Please select a driver name!" = "下載：請選擇一個驅動程式名稱！";

/* installToolsController */
"Download: Please select a tool name!" = "下載: 請選擇一個工具名稱!";

/* kextsInstallerController */
"Download: Please select a kext name!" = "下載：請選擇一個 kext 名稱！";

/* opencoreDownloaderController */
"Downloading %@" = "下載中 %@";

/* reading_savingOperation */
"Error" = "錯誤";

/* opencoreDownloaderController */
"Error during unzipping file!" = "解壓縮檔案時發生錯誤！";

/* opencoreDownloaderController */
"Error: %@" = "錯誤: %@";

/* kextsInstallerController */
"FakeSMC detected... Choose an add on to install..." = "檢測到FakeSMC ...選擇要安裝的檔案......";

/* No comment provided by engineer. */
"GB/s" = "GB/s";

/* sectionSourceListHexConverterPopover */
"HEX converter" = "16進制轉換器";

/* sectionSourceListHexConverterPopover */
"HEX string" = "16進制字串";

/* No comment provided by engineer. */
"Hour" = "小時";

/* No comment provided by engineer. */
"Hours" = "小時";

/* openPanelConfigConverterTool */
"Import a Clover config file for conversion" = "導入 Clover 配置文件以進行轉換";

/* installDriversController
   kextsInstallerController
   opencoreDownloaderController */
"Initialization: Unable to read database. Cannot find server or there's no internet connection." = "初始化：無法讀取資料庫。找不到伺服器或沒有網路連接。";

/* bdmesgController */
"Nothing to read here! Try to configure \"Target\" key in Misc->Debug section" = "現在這裡什麼都看不到！ 試試在Misc-其他設定->Debug部分設定\"Target\"輸入，具體内容参照OC官方PDF說明文件";

/* sectionSourceListHexConverterPopover */
"Invalid base64 data" = "無效base64數據";

/* sectionSourceListHexConverterPopover */
"Invalid data" = "無效數據";

/* sectionSourceListHexConverterPopover */
"Invalid HEX data" = "無效的十六進制數據";

/* No comment provided by engineer. */
"KB/s" = "KB/s";

/* sidebarMenu */
"Kernel" = "Kernel-內核設定";

/* left_toolbar */
"Load Configuration" = "載入設定檔";

/* kextsInstallerController */
"Manual Installation: %@ has been successfully copied to %@" = "手動安裝 %1$@ 已成功複製到%2$@";

/* kextsInstallerController */
"Manual Installation: %@ has been successfully updated to %@" = "手動安裝: %1$@ 已成功更新至 %2$@";

/* kextsInstallerController */
"Manual Installation: %@ successfully backed up to %@" = "手動安裝: %1$@已成功備份至 %2$@";

/* kextsInstallerController */
"Manual Installation: ERROR: %@" = "手動安裝 :錯誤: %@";

/* kextsInstallerController */
"Manual Installation: ERROR: You don't have permission to write here!" = "手動安裝: 錯誤: 你沒有在這裡進行寫入的權限！";

/* kextsInstallerController */
"Manual Installation: Kext file required!" = "手動安裝：需要 Kext 文件！";

/* kextsInstallerController */
"Manual Installation: Path doesn't exist!" = "手動安裝：路徑不存在！";

/* No comment provided by engineer. */
"MB/s" = "MB/s";

/* No comment provided by engineer. */
"Minute" = "分鐘";

/* No comment provided by engineer. */
"Minutes" = "分鐘";

/* sidebarMenu */
"Misc" = "Misc-其他設定";

/* mountefiController */
"Mount Point:" = "掛載點:";

/* mountefiController */
"Mount Point: %@" = "掛載點: %@";

/* mountefiController */
"Mount Point: N/A" = "掛載點: N/A";

/* opencoreDownloaderController */
"No EFI folder found. Creating one...." = "找不到已掛載的EFI分區。建立一個....";

/* sidebarMenu */
"NVRAM" = "NVRAM-非揮發性記憶體設定";

/* opencoreDownloaderController */
"Old file has been renamed to BOOTx64_%@.efi.bak" = "舊文件已重新命名為BOOTx64_%@.efi.bak";

/* opencoreDownloaderController */
"Old file has been renamed to OpenCore_%@.efi.bak" = "舊文件已重新命名為OpenCoree_%@.efi.bak";

/* reading_savingOperation */
"OpenCore Configurator could not be synchronized because an error occurred: %@" = "由於發生錯誤，OpenCore Configurator無法同步: %@";

/* pasteBoardController */
"Paste" = "貼上";

/* left_toolbar */
"Paypal - Free Donation" = "Paypal - 斗內";

/* sidebarMenu */
"PlatformInfo" = "PlatformInfo-機型平台設定";

/* reading_savingOperation */
"Repair" = "修復";

/* mainMenu */
"Restart" = "重新啟動";

/* left_toolbar */
"Save" = "儲存";

/* left_toolbar */
"Save As..." = "另存為...";

/* left_toolbar */
"Save, Save As Configuration" = "儲存, 另存為新配置";

/* No comment provided by engineer. */
"Second" = "秒";

/* No comment provided by engineer. */
"Seconds" = "秒";

/* left_toolbar */
"Share" = "分享";

/* kextsInstallerController */
"Show Location: Path doesn't exist!" = "顯示位置：路徑不存在！";

/* mountefiController */
"Size:" = "容量:";

/* kextsInstallerController */
"Some info for %@.kext => Identifier: %@ | Version: %@%@" = "資訊: %1$@.kext =>Identifier: %2$@ | 版本: %3$@%4$@";

/* rtvariablesController */
"Sorry to generate a valid ROM, you need unique UUID in SystemParameters->Custom UUID (copy from system or generate one) or go in SMBIOS->Smuuid and add a valid uuid in the format: XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX." = "抱歉生成有效的ROM，您需要SystemParameters-> Custom UUID中的唯一UUID（從系统複製或生成一個）或進入SMBIOS-> Smuuid並加入以下格式的有效uuid：XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX 。";

/* mountefiController */
"Status:" = "狀態:";

/* reading_savingOperation */
"Synchronized" = "同步";

/* sectionSourceListHexConverterPopover */
"text string" = "文字字串";

/* mainMenu */
"To apply this change, you must restart the app" = "要套用此修改，您必須重新啟動應用程式";

/* mainMenu */
"Do you also want to change fork type?" = "您還想更改分支類型嗎？";

/* mainMenu */
"Do you also want to change configuration properties type?" = "您是否還想更改版本屬性類型？";

/* sidebarMenu */
"UEFI" = "UEFI-UEFI設定";

/* installDriversController
   opencoreDownloaderController */
"Unable to read database." = "無法讀取資料庫。";

/* mountefiController */
"Untitled" = "無標題";

/* opencoreDownloaderController */
"Unzip process was aborted because I can't create a backup" = "解壓縮過程中止，因為我無法建立備份";

/* kextsInstallerController */
"Unzip: Error during unzipping file!" = "解壓縮：解壓縮文件時出錯!";

/* opencoreDownloaderController */
"Unzipped..." = "解壓縮...";

/* kextsInstallerController */
"Update available for %@.kext => Local version: %@ | Remote version: %@" = "更新可用於 %1$@.kext =>本機版本: %2$@ | 遠端版本: %3$@";

/* kextsInstallerController */
"VirtualSMC detected... Choose an add on to install..." = "檢測到VirtualSMC ...選擇要安裝的檔案...";

/* kextsInstallerController */
"Intel Wi-Fi detected... Choose an add on to install..." = "Intel Wi-Fi detected... Choose an add on to install...";

/* mountefiController */
"Volume Identifier:" = "卷宗代號:";

/* mountefiController */
"Volume Identifier: %@" = "卷宗代號: %@";

/* mountefiController */
"Volume Identifier: %@ Status: [Current Boot Disk]" = "卷宗代號: %@ 狀態: [當前啟動硬碟]";

/* mountefiController */
"Volume Name:" = "卷宗名:";

/* mountefiController */
"Volume Name: %@" = "卷宗名: %@";

/* mountefiController */
"Volume UUID:" = "卷宗UUID:";

/* mountefiController */
"Volume UUID: %@" = "卷宗UUID: %@";

/* mountefiController */
"Volume UUID: N/A" = "卷宗UUID: N/A";

/* opencoreDownloaderController */
"You don't have permission to write here!" = "您沒有權限在這裡寫入！";

/* dockMenu */
"New Configuration..." = "新建配置...";

/* dockMenu */
"Open Configuration..." = "打開配置...";

/* dockMenu */
"Leave A Message" = "留言";

/* installDriversController opencoreDownloaderController */
"No EFI folder found.....\n" = "未找到已掛載的EFI分區！\n";

/* preferencesPanel */
"Release Version" = "正式版";

/* preferencesPanel */
"Development Version" = "開發版";

/* deviceProperties_table_properties_menu */
"Audio Device Properties" = "音頻裝置屬性";

/* deviceProperties_table_properties_menu */
"Video Device Properties" = "视频裝置屬性";

/* deviceProperties_table_properties_menu */
"Advanced Properties" = "高級屬性";

/* deviceProperties_table_properties_menu */
"display number" = "等顯示器编號";

/* deviceProperties_table_properties_menu */
"Connections" = "接口";

/* deviceProperties_table_properties_menu */
"connector index" = "等接口索引号號";

/* deviceProperties_table_properties_menu */
"Other" = "其它";

/* deviceProperties_table_properties_menu */
"Presets" = "預設值";

/* deviceProperties_table_properties_menu */
"High Sierra" = "High Sierra";

/* deviceProperties_table_properties_menu */
"Mojave and above" = "Mojave或更高版本";

/* deviceProperties_table_properties_menu */
"Device Properties" = "裝置屬性";

/* deviceProperties_table_properties_menu */
"Help" = "協助";

/* deviceProperties_table_properties_menu */
"Select '%@' device before adding '%@' key" = "在增加'%2$@'鍵之前選擇'%1$@'裝置";

/* deviceProperties_table_properties_menu */
"Select a '%@' device before adding a preset" = "在增加預設之前選擇一個'%1$@'裝置";

/* deviceProperties_table_properties_menu */
"Select a Platform ID before adding a preset" = "在增加預設之前選擇平台ID";

/* deviceProperties_table_properties_menu */
"Select a valid device path" = "選擇一個有效的裝置路徑";

/* deviceProperties_table_properties_menu */
"Product Name" = "產品名稱";

/* deviceProperties_table_properties_menu */
"CPU Codename" = "CPU架構";

/* deviceProperties_table_properties_menu */
"Platform ID" = "平台ID";

/* deviceProperties_table_properties_menu */
"Device ID" = "裝置ID";

/* deviceProperties_table_properties_menu */
"Device Name" = "裝置名稱";

/* deviceProperties_table_properties_menu */
"Available Device IDs" = "可用裝置ID";

/* deviceProperties_table_properties_menu */
"Available Models" = "可用型號";

/* nvram_add_properties_table */
"Select a valid UUID" = "選擇一個有效的UUID";

/* compatibilityWarningScreen */
"You seem to have an old version of OpenCore bootloader." = "您似乎使用了一個舊版本的OpenCore引導程式。";

/* compatibilityWarningScreen */
"The bootloader looks like it is not installed or your NVRAM isn't native." = "引導程式看起来好像沒有安裝，或者您的NVRAM不是本機的。";

/* compatibilityWarningScreen */
"2nd_message" = "此應用程式為%1$@或更高版本建立配置文件.";

/* compatibilityWarningScreen */
"Use at your own risk" = "使用後果自負!";

/* compatibilityWarningScreen */
"(select 'Backup File Before Saving' in Preferences Pane)" = "(在'首選項'窗格中選擇'儲存前備份文件'')";

/* advancedUser */
"The key “%@” already exists in containing item." = "包含項目的鍵“%@”已存在。";

/* advancedUser */
"(%lu items)" = "(%lu个項目)";

/* advancedUser */
"Item %lu" = "項目 %lu";

/* advancedUser */
"New item" = "新項目";

/* outlineMode */
"Cut" = "剪下";

/* outlineMode */
"Copy" = "複製";

/* outlineMode */
"Paste" = "貼上";

/* outlineMode */
"Delete" = "删除";

/* outlineMode */
"Value Type" = "值類型";

/* outlineMode */
"Array" = "數組";

/* outlineMode */
"Dictionary" = "字典";

/* outlineMode */
"Boolean" = "布林";

/* outlineMode */
"Data" = "數據";

/* outlineMode */
"Date" = "日期";

/* outlineMode */
"Number" = "數字";

/* outlineMode */
"String" = "字串";

/* outlineMode */
"Add Item" = "增加";

/* outlineMode */
"Replace" = "替換";

/* outlineMode */
"Key" = "鍵";

/* outlineMode */
"Type" = "資料類型";

/* outlineMode */
"Value" = "值";

/* miscController */
"Please make sure to select a file from a boot efi path." = "請確保從引導efi路徑中選擇一個文件。";

/* miscController */
"No efi boot path found." = "找不到efi引導路徑。";

/* quicktoolsController */
"%@ on Disk Identifier: %@" = "硬碟代號上的%1$@: %2$@";

/* quicktoolsController */
"Status: [%@]" = "狀態: [%@]";

/* quicktoolsController */
"OpenCore Boot Partition" = "OpenCore引導分區";

/* preferencesPanel */
"Official" = "官方原版";

/* preferencesPanel */
"MOD" = "MOD分支版";

/* preferencesPanel */
"App Settings" = "應用設定";

/* preferencesPanel */
"OpenCore Settings" = "OpenCore設定";

/* titleBar */
"Release Configuration" = "%1$@ 正式版配置";

/* titleBar */
"Development Configuration" = "%1$@ 開發版配置";

/* titleBar */
"for Official OpenCore" = "官方原版OpenCore";

/* titleBar */
"for MOD OpenCore" = "MOD修改版OpenCore";

/* reading_savingOperation */
"This configuration contains one or more properties that Official OpenCore doesn't usually use. Do you want to open this configuration in MOD mode?" = "此配置包含一個或多個官方OpenCore通常不使用的屬性。是否要以MOD修改本模式打開此配置？";

/* reading_savingOperation */
"This configuration contains standard properties but you are working in MOD mode. Do you want switch to Official mode?" = "此配置檢測為官方版本，但是您正在MOD版OC模式下工作。您要切換到官方版本模式吗？";

/* reading_savingOperation */
"For changes to take effect, this app will be relaunched" = "為了使更改生效，此應用將重新啟動";

/* outlinemodeController */
"If you continue, all unknown keys will be lost" = "如果切换回GUI模式，所有手工添加的未知鍵值將失去！";

/* textmodeController */
"Syncronize" = "同步";

/* textmodeController */
"Syncronize Outline Mode" = "同步樹形編輯器模式";

/* importPatchesController */
"Import set of patches" = "導入補丁集合";

/* importPatchesController */
"Import set of kexts" = "導入Kext集合";

/* importPatchesController */
"Export selected patches" = "匯出所選為匯出集";

/* importPatchesController */
"Export selected kexts" = "匯出所選kexts集合";

/* importPatchesController */
"Add set of patches from database" = "導入在線預設匯出集合";

/* importPatchesController */
"Add set of kexts from database" = "導入在線預設KEXT集合";

/* importPatchesController */
"Battery Patches" = "電池更名匯出";

/* importPatchesController */
"Rename Patches" = "常規更名匯出";

/* configCheckerController */
"Check current configurations (if you managing multiple windows, select the window you want to check). Save your configuration before continuing to check." = "檢查當前配置完善性 (如果管理多個視窗，請選擇要檢查的視窗). 繼續檢查配置前儲存你的配置文件.";

/* configCheckerController */
"Import configuration from local selecting \"Choose...\"" = "從\"選擇...\"選擇本地文件匯入 ";

/* configCheckerController */
"Drag your configuration here" = "將您的配置文件拖曳到此處";

/* configCheckerController */
"No Network Access" = "無網際網路連線";

/* configCheckerController */
"Uploading..." = "上傳...";

/* configCheckerController */
"Downloading Resources..." = "下載資源文件...";

/* configCheckerController */
"Downloaded %.2f MB of %.2f MB (%@)" = "已下載 %1$.2f MB/%2$.2f MB (%3$@)";

/* configCheckerController */
"Resources Extraction..." = "提取資源文件...";

/* configCheckerController */
"Ready!" = "完成!";

/* configCheckerController */
"Error extracting resources files!" = "提取資源文件時發生錯誤!";

/* configCheckerController */
"Failed to download resources!" = "下載資源文件失敗!";

/* configCheckerController */
"Updating Resources..." = "更新資源文件...";

/* configCheckerController */
"Checking For Resources..." = "檢查資源文件...";

/* configCheckerController */
"Desktop" = "普通桌上型電腦";

/* configCheckerController */
"High-End Desktop" = "高性能桌上型電腦";

/* configCheckerController */
"Laptop" = "筆記型電腦";

/* opencoreDownloaderController */
"Successfully backed up to %@" = "成功備份到 %@";

/* opencoreDownloaderController */
"Error during creating EFI backup folder!" = "建立EFI備份資料夾時發生錯誤!";

/* ocValidator */
"Connection Established" = "連結已建立";

/* ocValidator */
"Failed to checking resources!" = "無法檢查資源!";

/* platformInfoController */
"No Network Access. You may not get latest SMBIOS data." = "無網際網路連線。您可能無法取得最新的SMBIOS資料.";

/* installDriversController */
"Download: %@ removed from queue because is not compatible with 32-bit version." = "下載: 由於與32位版本不相容，已從下載隊列中删除%@.";

/* efiMaker */
"Based on OpenCore Bootloader %@ settings by Dortania's help guide" = "基於Dortania幫助文件中的OpenCore Bootloader%@設定";

/* efiMaker */
"For more information about different settings, click on each CPU Family option" = "有關不同設定的更多資訊，請單擊每個CPU系列選項";

/* efiMaker */
"Downloading latest Opencore Bootloader" = "下載最新的Opencore引導程式";

/* efiMaker */
"Error while downloading Opencore Bootloader. Unable to continue." = "下載Opencore引導程式時出錯。無法繼續.";

/* efiMaker */
"Downloading %@ configuration" = "正在下載%@配置";

/* efiMaker */
"Populating SMBIOS data for %@ configuration" = "為%@配置填充SMBIOS數據";

/* efiMaker */
"Error while downloading the configuration. Unable to continue." = "下載配置時出錯. 無法繼續.";

/* efiMaker */
"Error while populating %@ key" = "填充%@鍵值時出錯";

/* efiMaker */
"Some keys have not been updated. Please update them manually." = "某些鍵值尚未更新. 請手動更新.";

/* efiMaker */
"Done! Opening folder at %@" = "完成! 正在打開資料夾%@";

/* efiMaker */
"Download SSDT" = "下載SSDT";

/* efiMaker */
"successfully downloaded" = "成功下載";

/* efiMaker */
"Download SSDT Error" = "下載SSDT錯誤";

/* efiMaker */
"Downloading latest" = "正在下載最新文件";

/* efiMaker */
"Download essential Kext" = "下載基本Kext文件";

/* efiMaker */
"Download Kext Error" = "下載Kext文件錯誤";

/* efiMaker */
"Download Drivers" = "下載驅動程式文件";

/* efiMaker */
"Download Drivers Error" = "下載驅動程式錯誤";

/* efiMaker */
"Error during processing" = "處理期間發生錯誤";

/* efiMaker */
"For more information about %@ settings, click here" = "有關%@設定的更多訊息, 點擊這裡";

/* efiMaker */
"For more information about %@ settings" = "有關%@設定的更多訊息";

/* efiMaker */
"click here" = "點擊這裡";

/* efiMaker */
"Summary Information" = "摘要訊息";

/* efiMaker */
"CPU Family selected" = "已選擇的CPU系列";

/* efiMaker */
"SMBIOS selected" = "已選擇的SMBIOS機型";

/* efiMaker */
"Configuration type selected" = "已選擇的配置類型";

/* efiMaker */
"Architecture type selected" = "已選擇的體系類型";

/* efiMaker */
"Download related files" = "下載相關文件";

/* opencoreDownloaderController */
"Starting compiling gettext tools. This process may take a while on some machines, so please be patient. If this process asking to install Java SDK, please just skip that message." = "開始編譯 gettext 工具。 在某些機器上，此過程可能需要一段時間，因此請耐心等待。 如果此過程要求安裝 Java SDK，請跳過該訊息。";

/* opencoreDownloaderController */
"GETTEXT is missing!, downloading..." = "缺少 GETTEXT，正在下載...";

/* opencoreDownloaderController */
"Building GETTEXT..." = "正在編譯 GETTEXT...";

/* opencoreDownloaderController */
"Error while compiling resources for localization" = "當編譯地區性資源時發生錯誤";

/* opencoreDownloaderController */
"Xcode Application needed." = "需要 Xcode 應用程式.";

/* opencoreDownloaderController */
"Download XCode" = "下載 XCode";

/* opencoreDownloaderController */
"In order to use this section, please install Xcode application." = "為了使用此部分，請安裝 Xcode 應用程式";

/* opencoreDownloaderController */
"Start Building...." = "開始編譯....";

/* opencoreDownloaderController */
"Error occurred during building OpenCorePkg" = "當編譯 OpenCorePkg 時 發生錯誤";

/* opencoreDownloaderController */
"Operation aborted by user" = "使用者停止處理程序";

/* themesDownloader*/
"successfully downloaded and installed" = "successfully downloaded and installed";

/* themesDownloader */
"Download: Please select a theme name!" = "Download: Please select a theme name!";

/* themesDownloader */
"Update available for %@ theme" = "Update available for %@ theme";

/* themesDownloader */
"didn't pass the requirements check. For more information you need to open Themes Validator." = "didn't pass the requirements check. For more information you need to open Themes Validator.";

/* themesDownloader */
"Resources folder" = "Resources folder";

/* themesDownloader */
"Do you want open Themes Validator?" = "Do you want to open it?";

/* themesDownloader */
"Open Themes Validator" = "Open Themes Validator";

/* themesDownloader */
"Set as default" = "Set as default";

/* themesValidator */
"doesn't contain" = "doesn't contain";

/* themesValidator */
"this file is required." = "this file is required.";

/* themesValidator */
"Label folder doesn't contain" = "Label folder doesn't contain";

/* themesValidator */
"Font folder doesn't contain" = "Font folder doesn't contain";

/* themesValidator */
"OpenCanopy requires graphical resources located in Resources directory to run. There seem to be missing files. Sample resources (fonts, label and images) can be found in OcBinaryData repository, do you want to download it?" = "OpenCanopy requires graphical resources located in Resources directory to run. There seem to be missing files. Sample resources (fonts, labels and images) can be found in OcBinaryData repository, do you want to download it?";

/* themesValidator */
"Downloading OCBinaryData..." = "Downloading OCBinaryData...";

/* themesValidator */
"All resources have been successfully copied." = "All resources have been successfully copied.";

/* themesValidator */
"Fonts have been successfully copied." = "Fonts have been successfully copied.";

/* themesValidator */
"Labels have been successfully copied." = "Labels have been successfully copied.";

/* themesValidator */
"Images have been successfully copied." = "Images have been successfully copied.";

/* themesValidator */
"Starting validation for OC Resources folder" = "Starting validation for OC Resources folder";

/* themesValidator */
"Reason:" = "Reason:";

/* themesValidator */
"Label folder:" = "Label folder:";

/* themesValidator */
"Passed" = "Passed";

/* themesValidator */
"Not Passed" = "Not Passed";

/* themesValidator */
"Font folder:" = "Font folder:";

//---------------- TOOLTIPS---------------------------->>>>>>>>>>>>>>

/* acpiController */
/* Add */
/* 9ZU-zR-Tmy */
"TT_acpi_addTable" = "這部分主要填寫我們使用的ACPI修補文件，以及DSDT文件，如果没有請把0-8的SSDT全部删除。如果你有修改的SSDT或者DSDT文件，請先將文件放入EFI/OC/ACPI下。\nACPI修補文件是黑蘋果的核心，針對OC的ACPI修補文件請參考宪武大神的OC-litte,https://github.com/daliansky/OC-little";

/* Delete */
/* 8sm-zn-vNl */
"TT_acpi_deleteTable" = "停用某個 ACPI 表, 比如常用於停用 DAMR 來關閉 VT-d。";

/* Patch */
/* 2tM-Ig-MFJ */
"TT_acpi_patchTable" = "這裡我們需要填寫一下ACPI的更名和修復文件。\n在10.15中，一些資料指出我們需要把EC控制器(EC0)重新命名為EC來確保能進入10.15系统(當然也可以用EC仿冒修補文件)\n華擎、華碩、微星主機板可能會遇到RTC時鐘問題而無法進入系统，這同樣需要加入修補文件来修復\n具體修補文件包可以查看宪武大神做的OC-Little修補文件包https://github.com/daliansky/OC-little\n\n1. Base\n通過取得到所提供路徑的偏移量来選擇ACPI路徑以進行修補文件尋找（或立即替換）.\n\n僅支持完全限定的對路徑（例如\\_SB_.PCI0.GFX0）.當前支援的對象類型是: Device, Field, Method.\n\n注意：請謹慎使用，並非所有OEM表都可以被解析.使用ACPIe實用程式進行Debug  使用DEBUG=1 make命令編譯的ACPIe會產生有用的ACPI尋找跟蹤. \n\n2. BaseSkip\n 設定為0:(不要跳過任何事件)\n在應用程式發現和替換之前要跳過的已發現基本事件的數量.\n\n3. Comment\n任意ASCII字符串，用於為項目提供可讀的参考. 是否使用此值由實現定義.\n\n4. Count\n設置為0 (將修補應用程式於發現的所有事件)\n要修補的出现次數。\n\n5. Enabled\n設定為true以套用此ACPI修補文件.\n\n6. Find\n數據尋找。如果設定，則必須等於替換大小.\n\n注意：如果指定了Base，則可以為空, 在這種情况下，發生基本查詢後立即替換.\n\n7. Limit\n設定為0 (搜尋整個ACPI表)\n搜尋的最大字串數.\n\n8. Mask\n設定為空 (被忽略)\n尋找比較期間使用的數據按位掩碼。 通過忽略未屏蔽（設定為零）位来進行模糊搜尋. 如果設定，則必須等於替換大小.\n\n9. OemTableId\n全為零 (匹配任何表的OEM ID)\n匹配表OEM ID等於此值.\n\n10. Replace\n一個或多個字串的替換數據.\n\n11. ReplaceMask\n替換期間使用的數據按位掩碼. 通過更新屏蔽（設定為非零）位来允許模糊替換.如果設定，則必須等於體換大小.\n\n12. Skip\n設定為0 (不要跳過任何事件)\n應用程式替換之前要跳過的發現事件數.\n\n13. TableLength\n設定為0 (匹配任何表大小)\n匹配表大小等於此值.\n\n14. TableSignature\n(匹配任何表簽名)\n匹配表簽名等於該值";

/* Quirks */
/* xYB-OX-ce7 */
"TT_FadtEnableReset" = "一些舊的主機板需要對FADT進行標記來開啟電腦的開機和關機功能，這裡我們不建議開啟它";

/* eza-Xg-dPF */
"TT_NormalizeHeaders" = "清理ACPI頭，一些主機板的ACPI表需要打開這個修復啟動。只有 macOS 10.13 需要";

/* iWF-dk-0VK */
"TT_RebaseRegions" = "換硬體、升级BIOS等對硬體的操作會對ACPI表產生影響，一般不需要打開，使用自定義 DSDT 則必須開啟";

/* u3f-B9-p1e */
"TT_ResetHwSig" = "存在重新啟動後因無法維持硬體簽名而導致從休眠中喚醒的問題的硬體需要開啟。一般選擇NO\n注意：此選項將來可能會被删除.";

/* 0zY-cF-e9r */
"TT_ResetLogoStatus" = "無法在有 BGRT 表的系统上顯示 OEM Windows 標誌的硬體需要開啟.";

"TT_SyncTableIds" = "Type: plist boolean\nFailsafe: false\nDescription: Sync table identifiers with the SLIC table.\n\nThis works around patched tables becoming incompatible with the SLIC table causing licensing issues in older Windows operating systems.";

/* booterController */
/* MmioWhitelist */
/* RWw-Gp-0A4 */
"TT_booter_mmioWhitelistTable" = "預設的第一項是為Haswell晶片組提供的記憶體尋址修復，如果此類晶片組碰到記憶體相關問題，請開啟它(enable選擇yes)。\n預設第二項是開機卡PCI Configuration這裡。ACPI、PCI device同時釋放到記憶體時發生0x1000記憶體地址被占用而卡在PCI Configration.如果碰到此類問題，請開啟它。";

/* oWj-qp-bH5 */
"TT_booter_patchTable" = "1. Arch\n引導程式修補文件架構 (Any, i386, x86_64).\n2. Comment\n用於為條目提供可讀参考的任意ASCII字串.\n3. Count\n要應用的修補文件出现次數. 設定為0將修補文件應用於發現的所有事件.\n4. Enabled\n除非設定為true，否則將不使用此啟動程式修補文件.\n5. Find\n數據尋找。長度必須等於替換.\n6. Identifier\nApple for macOS引導程式（通常為boot.efi）; 或帶有特定後綴的後綴名稱（例如bootmgfw.efi）;或任何/空字串（故障安全）以匹配任何引導程式.\n7. Limit\n搜尋的最大字節數. 可以設定為 0 以查看整個引導程式.\n8. Mask\n尋找比較期間使用的數據按位掩碼。通過忽略未隱藏（設定為零）位來允許模糊搜尋。可以設定為空數據以忽略。否則長度必須等於尋找.\n9. Replace\n一個或多個字節的替換數據.\n10. ReplaceMask\n替換期間使用的數據按位掩碼。通過更新隱藏（設定為非零）位來允許模糊替換. 可以設定為空數據忽略. 否則必須等於替換長度.\n11. Skip\n完成替換之前要跳過的發現事件次數.";

/* Quirks */
/* bib-aL-YwI */
"TT_AllowRelocationBlock" = "允許通過重定位塊引導macOS.\n\n重定位塊是分配给較低的4 GB的暫存緩衝區，用於由EfiBoot在韌體上載入 Kernel 和相關結構，在該韌體上，較低的記憶體被(假設是)非執行時數據占用。\n在 Kernel 啟動之前，重定位塊被複製回較低的地址。同樣，所有其他指向重定位塊的地址也進行了仔细調整. 在以下情况下可以使用重定位塊:\n•沒有更好的幻燈片存在（已使用所有記憶體）\n• slide = 0被強制(通過参數或安全模式)\n• 不支援KASLR(slide)(這是macOS 10.7或更舊的版本)\n\n此怪癖需要同時啟用ProvideCustomSlide，並且通常需要避免RuntimeDefrag才能正常工作. 使用重定位塊引導時不支援休眠(但是啟用了怪癖時，並不總是使用重定位塊).\n\n注意:雖然需要在具有較低記憶體的平台上執行舊版macOS，但需要執行該操作，但它與某些硬體和macOS 11不相容. 在這種情况下，您可以嘗試改用EnableSafeModeSlide.";

/* ubm-2i-zPE */
"TT_AvoidRuntimeDefrag" = "大部分UEFI都會寫入時間、電源管理等資訊，這個所有黑蘋果主機板都應該選擇YES.";

/* NUB-EN-5ql */
"TT_DevirtualiseMmio" = "記憶體注入方式包括KASLR方式(分布式注射到各個記憶體地址中）以及連續性方式。在使用KASLR時，PCIE載入到記憶體，可能會佔據所有所有avaliable值而導致OC的 Kernel 以及 Kernel Cache無法注入，導致啟動失敗。使用KASLR方式很容易出错，我們更適合使用連續性的記憶體注入方式，並在boot args中增加slide=1。因為我們之後會增加這個slide=1去使用連續性的記憶體注入方式，所以這個選項一般選擇NO.";

/* Ssn-0z-qIb */
"TT_DisableSingleUser" = "這裡關乎主機是否能開啟單使用者模式。開啟後會禁止 Cmd + S 和 -s 的使用，使裝置更加接近於 T2 白蘋果，如果你覺得有用就開啟它，一般選NO.";

/* KE8-rd-Ty5 */
"TT_DisableVariableWrite" = "非原生NVRAM主機板需要模擬nvram.plist進而寫入variable值，因此我們要禁止此項來防止其他程式對nvram進行寫入，我們這裡選YES。需要注意一點，如果你的主機板支援原生nvram(Z370/X299/C422)，請選擇NO！\n在 Z390/HM370 等沒有原生 macOS 支援 NVRAM 的主機板上需要開啟.";

/* ELB-6s-GBW */
"TT_DiscardHibernateMap" = "當電腦從休眠(hibernation)中喚醒時,硬碟裡的資料會復原到記憶體中去，但這個時候OC的 Kernel 以及 Kernel Cache等也會寫入，這樣可能導致衝突，這個選項是幫助我們解决這個問題的。而目前來看，除了Z370/X299/C422都無法進行休眠（注意睡眠sleep和休眠hibernation是兩個概念），桌機的话就更不需要休眠功能了，一般選擇NO。\n開啟後會重用原始休眠記憶體映射，僅某些舊硬體需要.";

/* qyH-8f-uTZ */
"TT_EnableSafeModeSlide" = "開啟後會允許在安全模式下使用 Slide 值。這個不是那麼重要，你不會每天進安全模式的。像Z390這樣本來也不用分布式注入記憶體方式的（KASLR），選擇YES，與正常情况下保持一致.";

/* xH6-La-kRg */
"TT_EnableWriteUnprotector" = "允許對UEFI執行時服務代碼的寫存取\n保证nvram能正常寫入而不受到UEFI内的一些服務的影響，無論什么主機板都要選擇YES.";

/* woE-nK-MFN */
"TT_ForceBooterSignature" = "Type: plist boolean\nFailsafe: false\nDescription: Set macOS boot-signature to OpenCore launcher.\n\nBooter signature, essentially a SHA-1 hash of the loaded image, is used by Mac EFI to verify the authenticity of the bootloader when waking from hibernation. This option forces macOS to use OpenCore launcher SHA-1 hash as a booter signature to let OpenCore shim hibernation wake on Mac EFI firmware.\n\nNote: OpenCore launcher path is determined from LauncherPath property.";

/* cTN-CD-c3M */
"TT_ForceExitBootServices" = "這個選項是讓那些非常老舊的主機板也能使用記憶體尋址，正常情况下選NO.";

/* 5Km-5w-nkl */
"TT_ProtectMemoryRegions" = "保護記憶體區域免受錯誤存取.\n一些韌體錯誤地映射了選定的儲存區域:\n• 可以將CSM區域標記為引導服務代碼或數據，從而將其留作XNU Kernel 的可用記憶體.\n• MMIO區域可以標記為保留記憶體並保持未映射狀態，但是可能需要在執行時對其進行存取以支援NVRAM.\n\n注意:有睡眠喚醒問題或引導失敗問題可嘗試開啟。只有非常老的韌體才需要此怪癖. 一般選NO";

/* VnZ-XI-LOq */
"TT_ProtectSecureBoot" = "保護UEFI安全啟動變量不被寫入.\n報告嘗試從操作系统寫入db，dbx，PK和KEK變量期間發生的安全衝突.\n\n注意：此怪癖主要嘗試避免碎片整理問題對NVRAM實施的影響，例如選擇Insyde或MacPro5,1.";

/* 3fG-t6-MF7 */
"TT_ProtectUefiServices" = "保護UEFI服務不被韌體覆蓋.\n包括硬體和虛擬機(例如VMware)在内的某些現代韌體可能會在驅動程式載入和相關操作期間更新指向UEFI服務的指針. 因此，這直接破壞了影響記憶體管理的其他怪癖，例如DevirtualiseMmio，並且還可能破壞其他怪癖，具體取决於這些怪癖的影響.\n\n注意：在VMware上，可以通過“您的Mac OS來賓系统可能不可靠地在多個虛擬 Kernel 上執行(Your Mac OS guest might run unreliably with more than one virtual core.)”資訊來診斷此問題.\n\nZ390晶片組建議使用!";

/* wGH-hP-xhD */
"TT_ProvideCustomSlide" = "是否使用slide值。一般選擇連續性注入記憶體並配合slide，所以選擇YES.\nBat.bat解释:\n如果 Slide 值存在衝突, 此選項將強制 macOS 執行以下操作:\n使用一個偽随機值. 只有在遇到 Only N/256 slide values are usable! 時需要.";

/* gi2-WY-dKJ */
"TT_ProvideMaxSlide" = "當沒有更高KASLR slide時，提供最大的KASLR slide。\n啟用ProvideCustomSlide時，此選項會覆蓋最大slide，而不是TOTAL_SLIDE_NUM（256）。可以相信，現代韌體從上到下分配池記憶體，有效地導致了slide掃描時的空閒記憶體，後來被用作 Kernel 載入期間的臨時記憶體。如果這些記憶體不可用，此選項可以停止評估更高的幻燈片。\n\n注意：此問題的必要性由啟用ProvideCustomSlide且随機slide落入不可用範圍時的随機引導失敗確定. 啟用AppleDebug時，通常 Debug 日誌中可能包含諸如AAPL之類的消息: [EB|‘LD:LKC] } Err(0x9). 要找到最佳值，請手動將slide = X附加到boot-args並紀錄不會導致啟動失敗的最大参數.";

/* JMF-hg-GgC */
"TT_RebuildAppleMemoryMap" = "建立與macOS相容的記憶體映射。Dell 5490如有啟動故障，可啟用此項!\n\n注意：此怪癖的必要性取决於早期啟動故障。該怪癖在大多數平台上替代了EnableWriteUnprotector.";

"TT_ResizeAppleGpuBars" = "Type: plist integer\nFailsafe: -1\nDescription: Reduce GPU PCI BAR sizes for compatibility with macOS.\n\nThis quirk reduces GPU PCI BAR sizes for Apple macOS up to the specified value or lower if it is unsupported. The specified value follows PCI Resizable BAR spec. Use 0 for 1 MB, 1 for 2 MB, 2 for 4 MB, and so on up to 19 for 512 GB. Apple macOS supports 1 GB maximum, which is 10. Use -1 to disable this quirk.\n\nConsider a GPU with 2 BARs:\n• BAR0 supports sizes from 256 MB to 8 GB. Its value is 4 GB.\n• BAR1 supports sizes from 2 MB to 256 MB. Its value is 256 MB.\n\nExample 1: Setting ResizeAppleGpuBars to 1 GB will change BAR0 to 1 GB and leave BAR1 unchanged.\nExample 2: Setting ResizeAppleGpuBars to 1 MB will change BAR0 to 256 MB and BAR0 to 2 MB.\nExample 3: Setting ResizeAppleGpuBars to 16 GB will make no changes.\n\nNote 1: See ResizeGpuBars quirk for general GPU PCI BAR size configuration and more details about the technology.\n\nNote 2: Certain GPU drivers do not support non-standard BAR sizes, causing sleep wake issues, for this reason for macOS it is recommended to use minimal supported BAR sizes, i.e. specify 0 (1 MB).";

/* l3S-mh-5k0 */
"TT_SetupVirtualMap" = "是否建立虛擬記憶體並對物理記憶體進行映射。我們在開機時，OC的程式需要一塊連續性的記憶體進行存放 Kernel 等東西，而實際的物理記憶體一般都是分散的。因此，我們通過虛擬記憶體建立連續性記憶體供OC使用，並映射到分散的物理記憶體中。一般我們選擇YES.";

/* Ryj-m2-2MI */
"TT_SignalAppleOS" = "報告通過OS Info載入的任何OS的macOS. \nMac OS韌體在不同的OS上具有不同的行為，因此該功能非常有用。例如，應該在某些雙GPU MacBook型號中在Windows和Linux中啟用Intel GPU。\一般用不到，選NO";

/* ymv-yt-Lvn */
"TT_SyncRuntimePermissions" = "更新記憶體權限以使OpenRuntime起作用. \n\n某些韌體可能會錯誤地將OpenRuntime標記為不可執行，此選項會更新記憶體映射和記憶體屬性表以更正此錯誤.\n\n注意：此怪癖的必要性取决於macOS或Linux/Windows中的早期啟動故障. 一般而言，僅2018年或之後發布的韌體會受到影響.";

/* devicesPropertiesController*/
/* Add */
/* ogK-XX-Zb9 */
"TT_devicesProperties_addTables" = "此項是用来注入你的裝置的，主要是顯示卡和音效卡兩部分。同樣你也可以訂製一些裝置到你的關於本機–系统報告–PCI列表中，儘管沒有多大的意義。";

/* Delete */
/* 1eh-jH-TX2 */
"TT_devicesProperties_deleteTables" = "從設備路徑投射（plist dict）到plist字串格式的變量名數組（plist數組）中删除設備属性。這裡的設定等同於 Clover 裡的 ACPI 重新命名 _DSM → XDSM + TgtBridge";

/* kernelController*/
/* Add */
/* pIA-W6-XA0 */
"TT_kernel_addTable" = "1. Arch\n Kext體系架構 (Any, i386, x86_64). \n2. BundlePath(捆绑路徑)\n Kext捆绑路徑 (例如 System\\Library \\Extensions \\IONetworkingFamily.kext).\n3. Comment(注釋)\n安全值: 空字符\n描述: 任意ASCII字串，用於為條目提供可讀的参考.\n4. Enabled(啟用)\n除非設定為true，否則不會增加此 Kernel 驅動程式.\n5. ExecutablePath(可執行路徑)\n Kext相對於包的可執行路徑 (例如: Contents/MacOS/IONetworkingFamily).\n6. Identifier(識別碼)\n Kext識別碼在增加之前執行狀態檢查 (例如 com.apple.iokit.IONetworkingFamily).\n僅增加在高速Cache中找不到識別碼的驅動程式.\n7. MaxKernel(最大 Kernel )\n 在指定的macOS版本或更早版本上增加 Kernel 驅動程式.\n注意: 請參考增加增加MaxKernel描述以取得匹配邏輯.\n8. MinKernel(最小 Kernel )\n 在指定的macOS版本或更高版本上增加 Kernel 驅動程式.\n注意: 請參考增加增加MaxKernel描述以取得匹配邏輯.\n9. PlistPath(plist路徑)\n 相對於包的Kext Info.plist路徑 (例如: Contents/Info.plist).";

/* Block */
/* 8UL-f2-RSc */
"TT_kernel_blockTable" = "1. Arch(架構)\n Kext阻止架構 (Any, i386, x86_64).\n2. Comment(注釋)\n 用於為條目提供可讀参考的任意ASCII字串。是否使用此值由實現定義.\n3. Enabled(啟用)\n 除非設定為true，否則不會阻止此 Kernel 驅動程式.\n4. Identifier(識別碼)\n Kext捆绑包識別碼（例如com.apple.driver.AppleTyMCEDriver）.\n5. MaxKernel(最大 Kernel )\n 在指定的macOS版本或更早版本上阻止 Kernel 驅動程式.\n6. MinKernel(最小 Kernel )\n 在指定的macOS版本或更高版本上阻止 Kernel 驅動程式.";

/* Force */
/* p2g-8y-f45 */
"TT_kernel_forceTable" = "1. Arch\n Kext體系架構 (Any, i386, x86_64). \n2. BundlePath(捆绑路徑)\n Kext捆绑路徑 (例如 System\\Library \\Extensions \\IONetworkingFamily.kext).\n3. Comment(注釋)\n安全值: 空字符\n描述: 任意ASCII字串，用於為條目提供可讀的参考.\n4. Enabled(啟用)\n除非設定為true，否則不會增加此 Kernel 驅動程式.\n5. ExecutablePath(可執行路徑)\n Kext相對於包的可執行路徑 (例如: Contents/MacOS/IONetworkingFamily).\n6. Identifier(識別碼)\n Kext識別碼在增加之前執行狀態檢查 (例如 com.apple.iokit.IONetworkingFamily).\n僅增加在高速Cache中找不到識別碼的驅動程式.\n7. MaxKernel(最大 Kernel )\n 在指定的macOS版本或更早版本上增加 Kernel 驅動程式.\n注意: 請參考增加增加MaxKernel描述以取得匹配邏輯.\n8. MinKernel(最小 Kernel )\n 在指定的macOS版本或更高版本上增加 Kernel 驅動程式.\n注意: 請參考增加增加MaxKernel描述以取得匹配邏輯.\n9. PlistPath(plist路徑)\n 相對於包的Kext Info.plist路徑 (例如: Contents/Info.plist).";

/* Patch */
/* 9hf-l6-OjL */
"TT_kernel_patchTable" = "這裡是為一些kext打修補文件用的。\n我們可以看到樣本裡面有四個修補文件，都是關閉著的，其中有兩個是關於APPLE RTC的，這對於華碩主機板來說相對比較重要，這裡我們需要對appleRTC相關的兩個修補文件一一測試，打開—–Enabled—YES其中一個，即可。如果不行，關閉一個打開另一個。這樣能解決華碩主機板重啟丢失BIOS設定以及需要按F1跳過安全模式，當然RTC仍然需要進一步的設定。\n等同於 Clover 的 KextToPatch 和 KernelToPatch";

/* Emulate */
/* 7Jq-Yr-TQY */
"TT_Cpuid1Data" = "此選項幫助Ivy Bridge 和一些不受支援的CPU載入電源管理的，所有選項按預設即可。";

/* WQz-t0-GJT */
"TT_Cpuid1Mask" = "此選項幫助Ivy Bridge 和一些不受支援的CPU載入電源管理的，所有選項按預設即可。";

/* Wjh-w3-4g8 */
"TT_MinKernel" = "模擬CPUID並在指定的macOS版本或更高版本上應用DummyPowerManagement.\n\n注意：有關匹配邏輯，請參考增加MaxKernel描述.";

/* SZI-EW-Tfa */
"TT_MaxKernel" = "模擬CPUID並在指定的macOS版本或更早版本上應用DummyPowerManagement.\n\n注意：有關匹配邏輯，請參考增加MaxKernel(最大 Kernel )描述.";

/* vK8-Z1-ZOI */
"TT_DummyPowerManagement" = "停用AppleIntelCpuPowerManagement.\n\n注意 1: 對於在macOS中沒有本機電源管理驅動程式的CPU，此選項是NullCpuPowerManagement.kext的首選替代方案.\n\n注意 2: 雖然通常需要此選項來在不受支援的平台上停用AppleIntelCpuPowerManagement，但在其他情况下，也可以使用它來停用此kext (例如對於Cpuid1Data留為空白).";

/* Scheme */
"TT_CustomKernel" = "Type: plist boolean\nFailsafe: false\nDescription: Use customised kernel cache from the Kernels directory located at the root of the ESP partition.\n\nUnsupported platforms including Atom and AMD require modified versions of XNU kernel in order to boot. This option provides the possibility to using a customised kernel cache which contains such modifications from ESP partition.";

/* wLJ-kT-oLE */
"TT_FuzzyMatch" = "在可用時將 Kernel Cache與不同的校驗和一起使用.\n在macOS 10.6和更早版本上，kernelcache文件名具有校驗和，本質上是SMBIOS產品名稱和EfiBoot裝置路徑中的adler32。在某些韌體上，由於ACPI或硬體方面的不同，EFIBoot裝置路徑在UEFI和macOS之間有所不同，從而使 Kernel Cache校驗和始終保持不變。\n此設定允許在沒有後綴的 Kernel Cache不可用時，將最新的 Kernel Cache與合適的體系結構進行匹配，從而提高了macOS 10.6在幾個平台上的啟動性能.";

/* zDQ-MU-J9A */
"TT_kernelArch" = "如果可用，最好使用指定的 Kernel 體系結構(Auto, i386, x86_64). \n在macOS 10.7和更早版本上，XNU Kernel 可能無法使用通常的x86_64體系結構進行引導，確切的選擇取決於許多因素，包括引導参數，SMBIOS和操作系统類型。當macOS和配置支援時，此設定將使用指定的體系結構來引導macOS。以下是確定 Kernel 架構的算法。\ n(a)映像参數（例如，通過UEFI Shell啟動時）或boot-args變量中的arch参數會覆蓋所有相容性檢查並強制指定架構.\n(b) 確定的EfiBoot版本限制架構選擇:\n• 10.4-10.5 — i386\n• 10.6-10.7 — i386 或 x86_64\n• 10.8 或更新的 — x86_64\n(c) 根據下表，SMBIOS模型資訊和EfiBoot版本限制客户端和服務器操作系统的體系結構選擇和定義體系結構首選項。\n(d) 如果支援體系結構並且KernelArch不是Auto，則KernelArch設定會更新客户端和服務器操作系统的體系結構首選項.\n(e) EfiBoot決定服務器啟動時選擇服務器或客户端首選項。\n\n注意 1: 與10.7及更高版本不同, 在10.6上，許多型號支援64位 Kernel 載入，但預設情况下將其停用. 在Apple支援網站上有關10.6 64位Mac型號相容性的資訊不正確，並且與實際的EfiBoot行為不符.\n\n注意 2: 由於EfiBoot中的錯誤，較舊的10.6服務器版本將以客户端模式啟動. 考慮使用此首選項解決此問題.";

/* ZjB-iQ-yjq */
"TT_kernelCache" = "如果可用，首選指定的 Kernel Cache類型(Auto, Cacheless, Mkext, Prelinked).\n\nmacOS的不同變量支援旨在提高啟動性能的不同 Kernel Cache變量.\n如果出於 Debug 和稳定性的原因而可以使用較慢的變量，則此設定將阻止使用較快的 Kernel Cache變量. 比如通過指定Mkext，預鏈接將被停用，比如只用於10.6，但不適用於10.7.";

/* Quirks*/
/* FUx-RJ-QTK */
"TT_AppleCpuPmCfgLock" = "請確保你的BIOS中已經關閉了CFG Lock。如果你不會解這個鎖，你就選擇YES，這個適用於四代以前的機型。\n選擇這項一般就不要選後面的XcpmCfgLock選項，解鎖的情况下選擇NO.";

/* 677-hy-Blh */
"TT_AppleXcpmCfgLock" = "請確保你的BIOS中已經關閉了CFG Lock。如果你不會解這個鎖，你就選擇YES，這個適用於四代以後的機型。\n選擇這項一般就不要選前面的CpupmCfgLock選項，解鎖的情况下選擇NO.";

/* v6y-N9-uHT */
"TT_AppleXcpmExtraMsrs" = "主要在沒有原生電源管理的CPU上啟用，一般是Haswell-E, Broadwell-E, Skylake-X這三種CPU需要填寫YES。除此之外的CPU選擇NO.";

/* cKa-I9-gvM */
"TT_AppleXcpmForceBoost" = "強制在XCPM模式下將電腦的cpu頻率鎖定為最高頻率，不建議開啟。\n此修補文件將0xFF00寫入MSR_IA32_PERF_CONTROL（0x199），一般而言，只有某些Xeon型號才能從該修補文件中受益.";

/* alh-j7-rix */
"TT_CustomSMBIOSGuid" = "對 UpdateSMBIOSMode 自定義模式執行 GUID 修補, 用於Dell筆記型電腦 (等同於 Clover 的 DellSMBIOSPatch).";

/* 6Aa-HL-hah */
"TT_DisableIoMapper" = "停用VT-D，我們在BIOS裡已經停用VT-D了，這裡我們選擇NO就行了.";

/* koV-S4-Tkn */
"TT_DisableLinkeditJettison" = "停用__LINKEDIT拋棄代碼.\n\n此選項使Lilu.kext和可能的其他功能在macOS Big Sur中以最佳性能執行而不適用keepsyms = 1啟動参數.";

/* RA3-U5-VwM */
"TT_DisableRtcChecksum" = "在AppleRTC中禁止寫入主校驗和。\n\n注意 1: 此選項不會保護其他區域不被覆蓋，如果需要，請參考RTCMemoryFixup Kernel 擴展。\n\n注意 2: 此選項不能保護區域在韌體階段不被覆蓋 (例如 macOS bootloader), 如果需要，請參考RTC（FIXME）部分.";

/* XZ1-7z-v2l */
"TT_ExtendBTFeatureFlags" = "將FeatureFlags設定為0x0F，以取得藍芽的全部功能，包括Continuity。\n\n注意：此選項代替了由於後期修補進度而無法正常執行的BT4LEContinuityFixup.kext.";

/* SGM-P1-Mz5 */
"TT_ExternalDiskIcons" = "AHCI控制器相關，現在的主機板都對AHCI支援的很好，一般選擇NO.";

/* Y9I-V0-r5N */
"TT_ForceSecureBootScheme" = "用於IMG4驗證的強制x86方案.\n\n注意：當使用與x86legacy不同的SecureBootModel時，此選項在虛擬機上是必需的.";

/* 8Db-Hu-t2R */
"TT_IncreasePciBarSize" = "解決卡PCI configuration，如果碰到請選擇yes, 一般選擇no。\n注意，一般卡pci configuration都是因為自己錯誤的設定或硬體問題。\n在 BIOS 中啟用 Above4GDecoding 是一種更加乾淨和安全的方法。某些 X99 主機板可能需要開啟, 這些主機板通常會在 IOPCIFamily 上遇到 Kernel 崩潰";

/* nsg-T6-DJT */
"TT_LapicKernelPanic" = "停用由 AP 核心 lapic 中斷造成的 Kernel 崩潰, 通常用於「HP電腦」 (等同於 Clover 的 Kernel LAPIC),無此問題選擇NO.";

/* Bdo-0T-kr8 */
"TT_LegacyCommpage" = "將預設的64位Combpage bcopy實現替換為不需要SSSE3的實現, 對舊平台有用. 由於沒有可用的不需要SSSE3的64位bcopy函數，這可以防止沒有最後一次緊急情况的commpage.";

/* axF-O3-KF9 */
"TT_PanicNoKextDump" = "一般選擇NO\n在發生 Kernel 崩潰時阻止输出 Kext 列表, 提供可供排错参考的崩潰日誌, 排错時請務必開啟.";

/* 6Mq-wE-cHt */
"TT_PowerTimeoutKernelPanic" = "修復 macOS Catalina 中由於裝置電源狀態變化逾時而導致的 Kernel 崩潰。\n當你遇到睡眠不能喚醒，只有重啟後才能睡眠喚醒，請試試選擇YES.";

"TT_ProvideCurrentCpuInfo" = "要求: 10.8\n向 Kernel 提供及時的 CPU 資訊 \n\n目前，該問題為 Kernel 提供了正確的 TSC 和 FSB 值, 以及停用 CPU 拓撲驗證。\n\n注意：這些修補程式及時針對 Microsoft Hyper-V，可能需要擴展以用於其他目的。";

/* yhV-cY-frg */
"TT_ThirdPartyDrives" = "為 SSD 啟用 TRIM 指令, NVMe SSD 會自動被 macOS 載入因此不需要, SATA SSD 可以在終端執行 sudo trimforce enable 開啟。\n同時修復 macOS 10.15 下非蘋果原廠 SSD 無法使用硬碟休眠 (hibernatemode 25).";

/* QzX-0b-2d3 */
"TT_XhciPortLimit" = "解除15個端口限制，如果USB端口已經訂製，請選擇NO.";

/* Ot6-tN-JLe */
"TT_SetApfsTrimTimeout" = "要求：10.14(較早版本不需要)\n\n為SSD上的APFS文件系统設定微調(以微秒為單位).\n根據SSD控制器的調整程式可能會花費大量時間, 導致啟動速度顯著下降，因為這是APFS驅動程式執行調整操作時. 如果SSD支援超額配置，或者存在專用的未使用分區可用於保留塊, 修剪操作可能不是必需的。另一方面，如果SSD速度慢, 預設逾時(等於9.999999秒)可能還不夠.\n\n將此值設定為4294967295以取得最大逾時以確保修剪成功，或將該值設定為999以實質上停用修剪.";

/* miscController */
/* Boot */
/* 5Or-M0-hZS */
"TT_pickermode" = "選擇用於啟動管理的啟動選擇器\n支援以下值:\n•Builtin(預設值)-引導管理由OpenCore處理，使用純文字使用者界面。\n•External-使用外部引導管理協議（如果可用),否則，將使用Builtin模式。\n•Apple-使用Apple引導管理(如果可用),否則，將使用Builtin模式.";

/* hdQ-rL-KAo */
"TT_pickerattributes" = "設定啟動選單(GUI界面)的屬性。\n可以配置自訂的GUI界面風格，設定值包括:\n• 0x0001 —提供引導項的自訂圖示:\n\t– APFS分區的引導根目錄下的.VolumeIcon.icns文件。 \n\t– 其他檔案系統的卷宗根目錄下的.VolumeIcon.icns文件。\n\t– <TOOL_NAME>.icns的工具圖示文件.￼ \n可以在Finder中設定卷圖示。 \n• 0x0002 — 提供引導項目的自訂渲染標題: ￼ \t– 引導器相關的.disk_label（.disk_label_2x）文件，用於所有檔案系統。 ￼ \t– 工具相關的<TOOL_NAME.lbl和<TOOL_NAME.l2x文件.可以透過 disklabel 實用程式或 bless 命令建立預渲染的標籤.停用或缺少文字標籤時 (.contentDetails 或 .disk_label.contentDetails) 將被使用.\n• 0x0004 — 提供引導項目的預定義標籤圖像，而無需自訂項目. 可能會缺少實際啟動項的詳細訊息. \n• 0x0008 — OC_ATTR_HIDE_THEMED_ICONS, 設定某些圖示類别的內建圖示以匹配主題樣式. 這可能會強制顯示內建的Time Machine圖示。 需要OC_ATTR_USE_VOLUME_ICON。\n• 0x0010 — 在選擇器中啟用指針控制(如果可用)。這可以利用滑鼠或觸控板來控制UI元素.";

/* gD0-Iz-n35 */
"TT_ConsoleAttributes" = "設定啟動選單的顏色屬性。\n支援根據UEFI規範將顏色参數的前景色和背景色之和計算並轉為十進制填入。\n顏色名稱列表：\n•0x00-EFI_BLACK\n•0x01-EFI_BLUE\n•0x02-EFI_GREEN\n•0x03-EFI_CYAN\n•0x04-EFI_RED\n•0x05-EFI_MAGENTA\n•0x06-EFI_BROWN\n•0x07-EFI_LIGHTGRAY\n•0x08-EFI_DARKGRAY\n•0x09-EFI_LIGHTBLUE\n•0x0A-EFI_LIGHTGREEN\n•0x0B-EFI_LIGHTCYAN\n•0x0C-EFI_LIGHTRED\n•0x0D-EFI_LIGHTMAGENTA\n•0x0E-EFI_BACKGROUND_LIGHTGRAY\n•0x0F-EFI_WHITE\n•0x00-EFI_BACKGROUND_BLACK\n•0x10-EFI_BACKGROUND_BLUE\n•0x20-EFI_BACKGROUND_GREEN\n•0x30-EFI_BACKGROUND_CYAN\n•0x40-EFI_BACK_ROG_RO_ROUND_RED\n•0x50-EFI_BACKGROUND_MAGENTA\n•0x60-EFI_BACKGROUND_BROWN\n•0x70-EFI_BACKGROUND_LIGHTGRAY\n注意：此選項可能不適用於系统文字渲染器。設定與黑色不同的背景可以幫助測試正確的GOP功能.";

/* Zxi-ww-dWk */
"TT_Timeout" = "倒計時進入指定可啟動系统，這裡我們按需求填寫，我填寫5，代表5秒鐘進入指定系统.";

/* QGG-If-K71 */
"TT_TakeoffDelay" = "在使用啟動選單和使用鍵盤快速鍵之前執行的延遲（以微秒為單位）。 \n使用這個選項可能會能更好的啟用模擬蘋果快速鍵的功能，例如引導至復原模式或其他。在某些平台上，由於鍵盤驅動程式的特性，可能完全需要將此選項設定為至少5000-10000微秒才能瀏覽操作hotkey.";

/* wPi-6s-R0s */
"TT_hibernatemode" = "檢測休眠模式。我們的機器一般都不支援休眠，選none。如果你的主機板支援原生nvram、並想測試休眠，可以考慮填auto。\n與系统内的休眠模式配合, 引導進系统會還原休眠前的狀態, 這個可能功能會影響SSD壽命, 建議關閉!";

/* M7r-QM-SNm */
"TT_PickerVariant" = "對於發行版設定值（Opencore最高為0.6.9版本）\n選擇用於 OC 引導選單的指定圖示主題。\n\n圖示集是相對於 Resources / Image 的目錄路徑,建議使用 Vendor\\Set格式提供他們,比如: Acidanthera\\GoldenGate\n\n支援以下值:\n• Auto — 根據預設背景顏色自動選擇一組圖示.比如使用 Acidanthera\\Chardonnay 用於淺灰色.\n• Default — (預設主題-預設使用 Acidanthera\\GoldenGate 目錄下的圖示主題文件).\n• 作為 OcBinaryData 儲存庫的一部分提供的範例資源提供了以下圖示集:\n   • Acidanthera\\GoldenGate-macOS 11 樣式的圖示集。\n   • Acidanthera\\Syrah-macOS 10.10 樣式的圖示集。\n   • Acidanthera\\Chardonnay-macOS 10.4 樣式的圖示集。\n• 其他值 — 可以自訂自己的主題風格,比如自己的主題圖示文件路徑為 Resources/Image/Mytheme/xxx ，那麼自訂主題的內容就填寫為 Mytheme\\xxx。\n\n注意事項:\n主題的圖示文件路徑必須在 EFI/OC/Resources/Image/XXXX/xxxx 資料夾下有對應格式的檔案名圖示,對於 0.6.6 以上版本,必須有包含 Left.icns 和 Right.icns 的圖示檔案名,否則會變為文字模式選單";

/* PDS-bo-Qx8 */
"TT_PickerAudioAssist" = "在啟動選擇器中啟用螢幕語音助理功能。\n也可以使用Command + F5組合鍵在OpenCore引導選擇器和macOS引導載入器FileVault 2登錄視窗中切换螢幕語音助理功能。\ n注意：螢幕語音輔助功能需要載入AudioDxe.ef音訊驅動.";

/* Yyf-Yd-yrP */
"TT_ShowPicker" = "顯示 OpenCore 的 UI, 用於查看可用引導選項\n設定為 NO 可以跳過倒計時, 和 PollAppleHotKeys=Yes 配合快速鍵可以大幅提升體驗\n一般選擇YES.";

/* zgV-bT-EgH */
"TT_HideAuxiliary" = "項目選擇器選單中的輔助項目,如果啟用項目預設項目，選為YES。\n至少滿足以下條件之一時，該項目被認為是輔助項目:\n•項目是macOS Recovery。\n•項目被明確標記為輔助。\n•項目是一個EFI程式(例如Clean NVRAM)\n\n通過按空格鍵，重新載入所有項目選擇器選單.";

/* vvg-w7-KxC */
"TT_PollAppleHotKeys" = "Type: plist boolean\nFailsafe: false\nDescription: Enable modifier hotkey handling in the OpenCore picker.\n\nIn addition to action hotkeys, which are partially described in the PickerMode section and are typically handled by Apple BDS, modifier keys handled by the operating system bootloader (boot.efi) also exist. These keys allow changing the behaviour of the operating system by providing different boot modes.\n\nOn certain firmware, using modifier keys may be problematic due to driver incompatibilities. To workaround this problem, this option allows registering certain hotkeys in a more permissive manner from within the OpenCore picker. Such extensions include support for tapping on key combinations before selecting the boot item, and for reliable detection of Shift along with other keys instead of only pressing the Shift key when selecting the boot item, in order to work around the fact that hotkeys which are continuously held during boot cannot be reliably detected on many PS/2 keyboards.\n\nThis list of known modifier hotkeys includes:\n• CMD+C+MINUS — disable board compatibility checking.\n• CMD+K — boot release kernel, similar to kcsuffix=release.\n• CMD+S — single user mode.\n• CMD+S+MINUS — disable KASLR slide, requires disabled SIP.\n• CMD+V — verbose mode.\n• Shift+Enter, Shift+Index — safe mode, may be used in combination with CTRL+Enter, CTRL+Index.";

/* IqM-FZ-Tdv */
"TT_launcherOption" = "在韌體首選項中註冊啟動器選項以實現持久性.\n可用值:\n• Disabled — 什麼也不做.\n• Full — 在引導載入程式啟動時，在UEFI變量儲存中建立或更新最高優先級引導選項。為了使此選項起作用，需要啟用RequestBootVarRouting.\n• Short — 建立一個短啟動選項，而不是完整的啟動選項。此選項對某些較舊的韌體(尤其是Insyde)很有用，但可能對無法處理完整裝置路徑的其他韌體無效.\n\n此選項在覆蓋\\EFI\\BOOT\\BOOTx64.EFI文件時提供與第三方操作系统安裝和升級的集成。. 通過在此文件路徑中建立自訂選項，該路徑不再用於引導OpenCore. 用於啟動的路徑在LauncherPath選項中指定.\n\n注意 1: 某些類型的韌體可能具有錯誤的NVRAM，不支援啟動選項或其他不相容性。雖然不太可能，但使用此選項甚至可能導致引導失敗。該選項應在沒有任何保證的情況下專門用於已知相容的主機板上.\n\n注意 2: 請注意，從OpenCore執行NVRAM重置時，不應抹除在Bootstrap中建立的引導選項, 在載入OpenCore之前執行NVRAM重置將删除它. 對於重大的實施更新（例如，在OpenCore 0.6.4中），請確保在重新啟用前停用Bootstrap來執行NVRAM重置.";

/* Uqn-Ww-mAH */
"TT_LauncherPath" = "LauncherOption的啟動路徑.\n\n對於啟動OpenCore.EFI的其他任何路徑(例如，\\EFI\\Launcher.EFI, 可用於提供訂製啟動器, 應該自己載入OpenCore.EFI.";

/* DEBUG */
/* PwU-cB-LIO */
"TT_DisplayDelay" = "在螢幕上可見的每行(即控制台)之後執行的延遲(以微秒為單位).預設忽略!";

/* omf-bH-d4v */
"TT_displaylevel" = "2147483714 在螢幕上顯示所有 Debug 訊息\n0 項目所有 Debug 訊息!";

/* 2Vb-s2-Ejp */
"TT_target" = "0: 關閉日誌紀錄\n3: 允許螢幕输出日誌\n19: 允許螢幕输出 UEFI 變量日誌\n67: 在 ESP 分區根目錄建立日誌文件 opencore-YYYY-MM-DD-HHMMSS.txt, 但螢幕上不顯示日誌！此功能需要用DEBUG版OC引導.";

/* LCd-qL-7KC */
"TT_DisableWatchDog" = "如果macOS在啟動時卡在某些地方, 可能需要設定為YES, 通常用於排除錯誤干擾";

/* fcn-ha-taM */
"TT_AppleDebug" = "啟用boot.EFI Debug 日誌儲存到OpenCore日誌。\n\n注意：此選項僅適用於10.15.4及更高版本.";

/* 2lk-2r-hIW */
"TT_ApplePanic" = "將macOSKernel緊急情況儲存到OpenCore根分區。\n該文件儲存為panic-YYYY-MM-DD-HHMMSS.txt格式。 強烈建議使用keepsyms = 1引導参數來查看緊急日誌中的 Debug 符號。 如果不存在，則可以使用kpdescribe.sh實用程式（與OpenCore捆绑在一起）部分恢復堆棧跟蹤。\n開發和 Debug Kernel會產生更多有用的Kernel恐慌。 考慮下載並安裝\n Debug 時，請使用來自developer.apple.com的KernelDebugKit。 要啟用開發Kernel，您將需要增加kcsuffix = development引導参數。 使用uname -a命令來確保當前載入的Kernel是開發（或 Debug ）Kernel。\n如果未使用OpenCoreKernel應急儲存機制，則可在/Library/Logs/Diagnostic目錄中找到Kernel應急。 從macOS開始，CatalinaKernel緊急事件以JSON格式儲存，因此在傳遞給kpdescribe.sh之前需要對其進行預先處理： \ncat Kernel.panic | grep macOSProcessedStackshotData | python -c 'import json,sys;print(json.load(sys.stdin)[\"macOSPanicString\"])'";

/* eFH-QH-phT */
"TT_SysReport" = "在EFI分區上建立系统報告。\n此選項將在ESP分區上建立SysReport目錄， 該目錄將包含ACPI和SMBIOS以及音訊codec轉儲。音訊編解碼器轉儲需要載入音訊後端驅動程式。\n\n注意：出於安全原因，RELEASE版本中不提供SysReport功能。如果需要此選項，請使用DEBUG版本.";

/* fmg-zD-rrJ */
"TT_SerialInit" = "執行串行端口初始化。\n此選項將在啟用 Debug 日誌紀錄之前在OpenCore中執行串行端口初始化。預設值如下:\n• PcdSerialBaudRate — Baud rate: 115200.\n• PcdSerialLineControl — Line control: no parity, 8 data bits, 1 stop bit.\n\n在“ Debug ”部分中查看更多詳細訊息.";

/* SECURITY */
/* QbL-ID-H0a */
"TT_HaltLevel" = "参考OC說明文件!";

/* tmf-fU-Pjy */
"TT_exposesensitivedata" = "3 - 將 OpenCore 的啟動路徑和版本儲存進 NVRAM\n11 - 在 3 的基礎上增加主機板 OEM 訊息, HWMonitorSMC2 和 NVMeFix 需要主機板 OEM 訊息才能正常工作\n6 - 如果要在引導選單顯示OC版本號，填6\n15 - 暴露所有NVRAM訊息.";

/* VQF-Ne-GWu */
"TT_scanpolicy" = "0: 允許掃描所有可用的硬碟\n其它值請参考官方文件, 對給出的選項做 16 進制加法運算";

/* 0yA-ct-dgi */
"TT_ApECID" = "Apple Enclave標示符。\n將此值設定為任何非零的64位整數將允許使用個人化的 Apple Secure Boot 標示符。設定此值且 SecureBootModel 有效且未停用的情況等效於實現 Apple Secure Boot 的完全安全性。如果要使用此設定，請確保使用加密安全的隨機數建立器建立隨機的64位數字. 設定此值且 SecureBootModel 有效且未停用，可以實現 Apple Secure Boot 的完全安全性.\n\n注意 1: 您必須重新安裝系统或使用 macOS DMG 恢復–將此值設定為非零後，個人化安裝。只有通過 macOS 恢復模式或使用 asr 建立的個人版本，才能安裝ApECID值設定為非零的操作系统。.\n\n注意 2: 當前，此選項的使用不可靠（顯然是 macOS 安裝程式中的錯誤），因此不建議使用此選項.";

/* QZk-2b-TCx */
"TT_vault" = "在OpenCore中啟用安全保險櫃機制。\n•Optional-不啟用任何安全機制,一般我們選這個。\n•Basic-要求OC目錄中存在vault.plist文件。這提供了基本的檔案系統完整性驗證，並可以防止意外的檔案系統損壞。\n•Secure-要求OC目錄中vault.plist的vault.sig簽名文件.";

/* KUQ-Na-LT4 */
"TT_dmgloading" = "嘗試提供引導載入程式的持久性。\n\n有效值s:\n• Disabled — 載入DMG映像將失敗。\n• Signed — 僅Apple簽署的DMG映像會載入。\n• Any — 任何DMG映像都將作為普通檔案系统掛載.";

/* l6D-xS-M37 */
"TT_secureBootModel" = "Apple安全啟動硬體模型。\n定義Apple安全啟動硬體模型和策略。 指定此值將定義可引導的操作系统。 在指定型號發布之前出廠的操作系统將無法啟動。有效值:\n\n• Default — 最近可用的模型，當前設定為x86legacy。\n• Disabled — 沒有型號，安全啟動將被停用。\n• j137 — iMacPro1,1 (2017年12月),最低macOS 10.13.2（17C2111）\n• j680 — MacBookPro15,1 (2018年七月),最低macOS 10.13.6（17C2112）\n• j132 — MacBookPro15,2 (2018年七月),最低macOS 10.13.6（17C2112）\n• j174 — Macmini8,1 (2018年十月) 最低macOS 10.14（18A2063）\n• j140k — MacBookAir8,1 (2018年十月) 最低macOS 10.14.1 (18B2084)\n• j780 — MacBookPro15,3 (2019年五月) 最低macOS 10.14.5 (18F132)\n• j213 — MacBookPro15,4 (2019年七月) 最低macOS 10.14.5 (18F2058)\n• j140a — MacBookAir8,2 (2019年七月) 最低macOS 10.14.5 (18F2058)\n• j152f — MacBookPro16,1 (2019年十一月) 最低macOS 10.15.1 (19B2093)\n• j160 — MacPro7,1 (2019年十二月) 最低macOS 10.15.1 (19B88)\n• j230k — MacBookAir9,1 (2020年3月) 最低macOS 10.15.3 (19D2064)\n• j214k — MacBookPro16,2 (2020年5月) 最低macOS 10.15.4 (19E2269)\n• j223 — MacBookPro16,3 (2020年5月) 最低macOS 10.15.4 (19E2265)\n• j215 — MacBookPro16,4 (2020年6月) 最低macOS 10.15.5 (19F96)\n• j185 — iMac20,1 (2020年8月) 最低macOS 10.15.6 (19G2005)\n• j185f — iMac20,2 (2020年8月) 最低macOS 10.15.6 (19G2005)\n\nPlatformInfo和SecureBootModel是獨立的，從而可以通過任何SMBIOS啟用Apple Secure Boot。\n將SecureBootModel設定為任何有效值但Disabled等效於Apple Secure Boot的\"中級安全性\"。 要获得完全安全性，還需要指定ApECID值。\n\n注意: 預設值會随著時間的增加而增加，以支援最新的主發行版操作系统。 不建議同時使用ApECID和預設值.";

/* NCW-lH-X8S */
"TT_PasswordHash" = "設定啟用密碼保護時使用密碼哈希算法.";

/* pYq-Ve-K08 */
"TT_PasswordSalt" = "設定啟用密碼保護時使用密碼加鹽算法.";

/* pTC-aG-QK1 */
"TT_AllowNvramReset" = "允許CMD + OPT + P + R或在啟動選單中顯示ResetNVRAM重置選單。\n\n提示:盡量不使用此項功能，用cleanNVRAM.EFI工具替代,因為一些主機板適用此功能後會導致啟動黑畫面而且無法進入BIOS界面的'硬體損壞'!";

/* 0sy-D3-AKk */
"TT_AuthRestart" = "Type: plist boolean\nFailsafe: false\nDescription: Enable VirtualSMC-compatible authenticated restart.\n\nAuthenticated restart is a way to reboot FileVault 2 enabled macOS without entering the password. A dedicated terminal command can be used to perform authenticated restarts: sudo fdesetup authrestart. It is also used when installing operating system updates.\n\nVirtualSMC performs authenticated restarts by splitting and saving disk encryption keys between NVRAM and RTC, which despite being removed as soon as OpenCore starts, may be considered a security risk and thus is optional.";

/* rQF-20-vFl */
"TT_AllowSetDefault" = "允許用CTRL+Enter或CTRL+Index(啟動選單項目编號)來設定啟動選單中的下次預設啟動選項.";

/* PbU-if-N7O */
"TT_EnablePassword" = "啟用密碼保護以允許敏感操作.\n\n密碼保護可確保敏感操作，例如引導非預設操作系统 (例如: macOS recovery或工具), 重置NVRAM儲存，嘗試引導到非預設模式 (例如: verbose(囉嗦)模式或safe(安全)模式) 如果沒有通過自訂密碼進行明確的使用者身份驗證，則不允許. 當前，密碼和加鹽密碼已通過SHA-512的5000000次選代進行哈希處理.\n\n注意: 此功能當前正在開發中，尚不能用於日常使用.";

/* Nph-Bb-8b6 */
"TT_BlacklistAppleUpdate" = "忽略嘗試更新Apple外設韌體的引導選項 (例如MultiUpdater.EFI).\n\n注意: 由於某些操作系统（即macOS Big Sur）無法使用NVRAM變量（run-EFI-updater）停用韌體更新，因此存在此選項.";

"TT_AllowToggleSip" = "Type: plist boolean\nFailsafe: false\nDescription: Enable entry for disabling and enabling System Integrity Protection in OpenCore picker.\n\nThis will toggle Apple NVRAM variable csr-active-config between 0 for SIP Enabled and a practical default value for SIP Disabled (currently 0x26F).\n\nNote1: It is strongly recommended not to make a habit of running macOS with SIP disabled. Use of this boot option may make it easier to quickly disable SIP protection when genuinely needed - it should be re-enabled again afterwards.\n\nNote2: OC uses 0x26F even though csrutil disable on Big Sur sets 0x7F. To explain the choice:\n• csrutil disable --no-internalactuallysets0x6F,andthisispreferablebecauseCSR_ALLOW_APPLE_INTERNAL (0x10) prevents updates (unless you are running an internal build of macOS).\n• CSR_ALLOW_UNAPPROVED_KEXTS (0x200) is generally useful, in the case where you do need to have SIP disabled, as it allows installing unsigned kexts without manual approval in System Preferences.\n• CSR_ALLOW_UNAUTHENTICATED_ROOT (0x800) is not practical as it prevents incremental (non-full) OTA updates.\n\nNote3: For any other value which you may need to use, it is possible to configure CsrUtil.efi as a TextMode Tools entry to configure a different value, e.g. use toggle 0x6F in Arguments to toggle the SIP disabled value set by default by csrutil disable --no-internal in Big Sur.";

/* BLESSOVERRIDE */
/* E7L-MW-EuK */
"TT_misc_blessoverrideTable" = "用於增加自訂EFI文件的引導絕對路徑，比如增加Windows的bootmgfw.EFI的位置以便辨識Windows引導項目,一般在OpenCore和Windows的引導文件在同一硬碟的同一ESP分區下使用，除非你有這種情況，不然我們不需要填寫任何東西。\n比如啟動Windows路徑:\\EFI\\Microsoft\\Boot\\bootmgfw.EFI\n這允許引導選擇器自動發現異常的引導路徑,也可用於其他操作系统的引導路徑";

/* ENTRIES */
/* 8Gl-6A-OsL */
"TT_misc_EntriesTable" = "用於指定OpenCore無法自動找到的無規律引導路徑。\n名稱:OpenCore啟動項中顯示的名稱\n啟用:啟用或停用\n輔助:設定項目為輔助項目，可在啟動選單中項目\n路徑:\n引導硬碟的PCI路徑，一般可以通過替換啟動文件為DEBUG版本，然後勾選Disable WatchDog選項，目標選項填入67，啟動一次後，在EFI分區裡產生的日誌文件裡尋找如: PciRoot(0x0)/Pci(0x1D,0x4)/Pci(0x0,0x0)/NVMe(0x1,09-63-E3-44-8B-44-1B-00)/HD(1,GPT,11F42760-7AB1-4DB5-924B-D12C52895FA9,0x28,0x64000)/\EFI\Microsoft\Boot\bootmgfw.EFI這樣的訊息。\n可以提前在MACOS裡使用diskutil info disk0s2 |grep \"UUID\"這樣的命令提前取得到你想要啟動的分區UUID，然後在日誌文件裡搜尋UUID的值，可以快速取得到完整PCI路徑！\n對於MOD的fork(MOD)版本，可在啟動界面按F9儲存所有啟動裝置路徑到文件並儲存在EFI分區\nTextMode(文字模式):是否以文字模式而不是圖形模式執行項目";

/* TOOLS */
/* eH6-nm-MdQ */
"TT_misc_toolsTable" = "用於執行一些UEFI工具, 例如驗證CFG Lock(VerifyMsrE2.EFI),CleanNvram.EFI\n名稱:OpenCore 啟動項中顯示的名稱\n啟用:啟用或停用\n輔助:設定項目為輔助屬性\n路徑:Tools資料夾下的檔案名稱\n如: VerifyMsrE2.EFI,Shell.EFI等\n\nRealPath(真實路徑):啟動時將完整路徑傳遞給工具.\n傳遞工具目錄對於不小心嘗試瀏覽文件而不檢查其完整性的工具可能是不安全的，因此通常應將其停用. 啟用此屬性的原因可能包括在沒有外部文件的情況下工具無法工作或可能需要它們以實現更好的功能的情況 (例如memtest86用於日誌紀錄和配置，或Shell用於自動腳本執行).\n注意：此屬性僅對工具有效. 對於項目，無法指定此屬性，並且始終為true.\n\nTextMode(文字模式): 是否以文字模式而不是圖形模式執行項目.\n對於某些需要文字輸出的較舊的工具，此設定可能是有益的。預設情況下，所有工具均以圖形模式啟動。在下面的“輸出屬性”部分中閱讀有關文字模式的更多訊息.";

/* nvramController */
/* Add */
/* s0e-p0-A6y */
"TT_nvram_addTables" = "4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14\nUIScale: OpenCore UI 和引導第一階段縮放\n01: 正常大小\n02: HIDPI (使 FileVault 和 蘋果標誌 在原生 HIDPI 顯示器上以正常大小顯示)\nDefaultBackgroundColor:設定MACOS啟動時第一階段的背景顏色，設定值為標準顏色的16進制值,比如一個顏色的標準值是123456,那麼這裡填入56341200，注意順序顛倒！\n7C436110-AB2A-4BBB-A880-FE41995C9F82\nboot-args: -v debug=0x100 (引導標示符)\ncsr-active-config: <00000000> (SIP 設定)\n00000000 - SIP 完全開啟\n30000000 - 允許未簽名的 Kext 載入並允許寫入受保護的文件系统路徑\nE7030000 - SIP 完全關閉\n67000000 - 不再推薦使用\nnvda_drv: <>\n設為 31 時啟用 NVIDIA WebDrivers\n没有 N 卡可以删除此項\nprev-lang:kbd: <0x7a682d48616e733a323532> (將預設語言設定為繁體中文, 留空為英文)";

/* tq7-BQ-JU5 */
"TT_nvramProperties_add_table" = "以下變量可能對某些配置或故障排除很有用\n• 7C436110-AB2A-4BBB-A880-FE41995C9F82\n1、boot-args\n内核参數，用於將配置傳遞给Apple Kernel 和驅動程式。有很多参數，一些已知的引導参數包括：\n–acpi_layer=0xFFFFFFFF\n–acpi_level=0xFFFF5F（表示ACPI_ALL_COMPONENTS）\n–batman = 值（AppleSmartBatteryManager Debug掩碼）\n–batman-nosmc=1（禁用AppleSmartBatteryManager SMC接口）\n–cpus=值（使用的最大CPU數量）\n–debug=值（Debug掩碼）\n–io=值（IOKit Debug掩碼）\n–keepsyms=1（顯示緊急日誌Debug符號）\n–kextlog=值（内核擴展載入Debug掩碼）\n–nv_disable=1（禁用NVIDIA GPU加速）\n–nvda_drv=1（啟用NVIDIA Web驅動程式的舊方法，已在10.12中删除）\n–npci=0x2000（舊方法，禁用kIOPCIConfiguratorPFM64）\n–lapic_dont_panic=1\n–slide=值（手動設定KASLR slide）\n–smcdebug=值（AppleSMCDebug掩碼）\n-amd_no_dgpu_accel（替代WhateverGreen的-radvesa用於新GPU）\n-nehalem_error_disable\n-no_compat_check（禁用機型檢查）\n-s（單使用者模式）\n-v（囉嗦模式）\n-x（安全模式）\n2、bootercfg\n引導程式参數，類似於boot-args，但包含boot.EFI。接受一組参數，這些参數是帶有或不帶有0x前缀的十六進制64位值，主要用於日誌紀錄控制：\nlog=值\n一般在啟動時不输出任何日誌，使用logo=0\ndebug=值\n一般在啟動時不輸出任何日誌，使用debug=0\nlevel=值\n一般不使用任何日誌，使用level=0。\n3、bootercfg-once\n首次啟動後，引導程式参數將被覆蓋。否則等效於bootercfg。\n4、fmm-computer-name\n當前儲存的電腦名。\n5、nvda_drv\n啟用NVIDIA Web Driver，只在10.13.x裡使用.";

/* Delete*/
/* ph9-2g-adH */
"TT_nvram_deleteTables" = "強制重寫 NVRAM 變量, 由於 Add 不會覆蓋 NVRAM 中已经存在的值, boot-args 需要利用此項來刷新";

/* LegacySchema */
/* cVF-o8-z0z */
"TT_nvram_legacySchemaTables" = "用於分配 NVRAM 變量, 與 LegacyEnable 配合使用\n您可以使用*值來接受所有用於選擇GUID的變量。\n警告：由於nvram.plist未被儲存，因此請非常謹慎地選擇變量。 例如，請勿放入boot-args或csr-active-config，因為這會繞過SIP。\n要從macOS讀取NVRAM變量值，可以使用nvram，方法是將變量GUID和名稱以：符號分隔。 例如，nvram 7C436110-AB2A-4BBB-A880-FE41995C9F82：boot-args。\n可以在對應的文件：NVRAM變量中找到連續更新的變量列表。\n警告：由於nvram.plist未被儲存，因此請非常謹慎地選擇變量。 例如，不要放入boot-args或csr-active-config，因為它可以繞過SIP.";

/* 2KJ-kg-wip */
"TT_LegacyEnable" = "允許從EFI卷宗根目錄載入為nvram.plist的NVRAM變量文件。\n没有原生NVRAM的裝置設定為YES\nmacOS下硬體NVRAM工作不正常的裝置設定為YES\nmacOS 下硬體 NVRAM 工作正常的裝置設定為 NO\n變量載入發生在“block”（和“add”）階段之前，並且不會覆蓋任何現有變量。 必須在LegacySchema中指定允許設定的變量。 第三方腳本可用於建立nvram.plist文件。 此類腳本的範例可以在“實用工具”中找到。 使用第三方腳本可能需要將ExposeSensitiveData設定為0x3才能為OpenCore EFI分區UUID提供引導路徑變量。\n警告：此功能非常危險，因為它將不受保護的數據傳遞到韌體可變服務。 僅當韌體未提供硬體NVRAM實現或與韌體不相容時才使用它.";

/* Bqu-cW-189 */
"TT_LegacyOverwrite" = "對模擬nvram使用者來說，將nvram.plist寫入韌體。\n注意：只是覆蓋可從操作系统瀏覽的變量，一般不建議開啟.";

/* 0qd-Qe-41F */
"TT_WriteFlash" = "允許為所有增加的變量寫入快閃記憶體。\n建議在大多數韌體上啟用此值，如果你的主機板BIOS因為NVRAM匯入垃圾内容，可關閉它.";

/* platformInfoController */
/* RfW-jb-UfW */
"TT_Automatic" = "選中此項時，OC不會應用DataHub ，PlatformNVRAM ，SMBIOS中的所有内容，\"自動\"選項要求必須配合Generic部分，詳細内容OpenCore.efi會根據Generic中的SystemProductName 匹配完成所有自動填充。\n所以選擇自動時，應該去掉這三個部分的\"在config.plist裡增加此部分内容\"選擇框，已防止這三部分内容在config文件裡寫入";

/* XRB-18-dHU */
"TT_UpdateDataHub" = "必須選YES, 無論\"自動\"選項是否選擇!";

/* zXC-sw-kEf */
"TT_UpdateNVRAM" = "必須選YES, 無論\"自動\"選項是否選擇!";

/* U5f-5A-ryt */
"TT_UpdateSMBIOS" = "必須選YES, 無論\"自動\"選項是否選擇!";

/* 9o2-8y-dq6 */
"TT_updatesmbiosmode" = "AUTO--通常使用Auto(自動)或Create(创建即可--(推薦Auto)\nCustom--Dell機器應該選擇Custom(自定義)\nOverWrite(覆蓋)--覆蓋現有的SmbiosTableGUID數據(不推薦)-如果當SmbiosTableGUID覆蓋過程中無法匹配新的大小則操作會被終止而導致SMBIOS數據注入失敗，引導時無法繞過相容性檢查出現開機禁行--报錯 ：This Version of MacOS X is not Supported on this Platform";

/* GZV-Yr-hPJ */
"TT_CustomMemory" = "使用自定義記憶體配置. 這將完全替換SMBIOS中的任何現有記憶體配置, 並且僅在UpdateSMBIOS設定為true時有效.";

/* 1BR-wt-792 */
"TT_UseRawUuidEncoding" = "對SMBIOS UUID使用原始編碼.\n\n每個UUID AABBCCDD-EEFF-GGHH-IIJJ-KKLLMMNNOOPP本質上是一個十六進制的16字節數字. 它可以通過兩種方式進行編碼:\n• Big Endian — 通過不寫任何順序就寫所有字節({AA BB CC DD EE FF GG HH II JJ KK LL MM NN OO PP}). 此方法也称為RFC 4122編碼或Raw編碼.\n• Little Endian — 通過將字節解释為數字並使用Little Endian字節表示形式 ({DD CC BB AA FF EE HH GG II JJ KK LL MM NN OO PP}).\nSMBIOS規範未明確指定直到SMBIOS 2.6的UUID的編碼格式，該規範指出應該使用Little Endian編碼. 由於不同的供應該商在此之前使用了不同的編碼，這導致了韌體實現和系统軟體的混亂。.\n• 蘋果在任何地方都使用Big Endian格式，但它忽略了macOS中的SMBIOS UUID.\n• dmidecode對SMBIOS 2.5.x或更低版本使用Big Endian格式，對2.6及更高版本使用Little Endian格式。.\nAcidanthera dmidecode可列印所有這三個.\n• Windows在所有地方都使用Little Endian格式，但是它只會影響值的視覺表示.\n\n在建立修改後的DMI表時，OpenCore始終設定最新的SMBIOS版本(當前為3.2)。如果啟用了UseRawUuidEncoding，則將使用Big Endian格式儲存SystemUUID數據。否則使用Little Endian.\n\n注意：由於DataHub和NVRAM中使用的UUID未標準化，因此由Apple增加, 這種偏好不會影響他們. 與SMBIOS不同，它們始終以Big Endian格式儲存.";

/* DataHub */
/* U5s-uE-f0J */
"TT_datahubCheckbox_add" = "Add or remove this section from plist\nFailsafe: Remove";

/* o9h-XT-hbD */
"TT_platformInfo_datahub_SystemProductName" = "預設值:未安裝\n描述:在gEfiMiscSubClassGuid中設定模型。在Mac上找到的值等於Unicode中的SMBIOS SystemProductName.";

/* agr-Am-FjN */
"TT_platformInfo_datahub_SystemSerialNumber" = "預設值:未安裝\n說明:在gEfiMiscSubClassGuid中設定SystemSerialNumber。在Mac上找到的值等於Unicode中的SMBIOS SystemSerialNumber.";

/* iip-zN-Jsb */
"TT_platformInfo_datahub_SystemUUID" = "預設值:未安裝\n描述:在gEfiMiscSubClassGuid中設定system-id。在Mac上找到的值等於SMBIOS SystemUUID.";

/* qOV-63-yas */
"TT_ARTFrequency" = "預設值:未安裝\n描述:在gEfiProcessorSubClassGuid中設定ARTFrequency。設定CPU ART頻率，Skylake和更新.";

/* h7z-Be-rOD */
"TT_platformInfo_datahub_BoardProduct" = "預設值:未安裝\n說明:在gEfiMiscSubClassGuid中設定board-id。在Mac上找到的值等於ASCII中的SMBIOS BoardProduct.";

/* vrV-lt-VAU */
"TT_BoardRevision" = "預設值:0\n描述:在gEfiMiscSubClassGuid中設定board-rev。在Mac上找到的值似乎對應該於内部板修訂（例如01).";

/* yKq-oF-Y1T */
"TT_DevicePathsSupported" = "預設值:未安裝\n說明:在gEfiMiscSubClassGuid中設定DevicePathsSupported。對於AppleACPIPlat- form.kext，必須設定為01才能將SATA裝置路徑附加到Boot ####和efi-boot-device-data變量。在所有現代Mac上設定為01.";

/* W2E-oe-9Uq */
"TT_FSBFrequency" = "預設值:自動\n描述:在gEfiProcessorSubClassGuid中設定FSBFrequency。設定CPU FSB頻率.";

/* 2Oj-go-m5S */
"TT_InitialTSC" = "預設值:0\n描述:在gEfiProcessorSubClassGuid中設定InitialTSC。設定初始TSC值，通常為0.";

/* BJm-4X-red */
"TT_PlatformName" = "預設值:未安裝\n描述:在gEfiMiscSubClassGuid中設定名稱。在Mac上找到的值是ASCII平台.";

/* bTa-i4-4eq */
"TT_SmcBranch" = "預設值:未安裝\n描述:在gEfiMiscSubClassGuid中設定RBr。 VirtualSMC或FakeSMC讀取的自定義屬性，用於建立SMC RBr私鑰。";

/* JBr-Jy-s8V */
"TT_SmcPlatform" = "預設值:未安裝\n描述:在gEfiMiscSubClassGuid中設定RPlt。 VirtualSMC或FakeSMC讀取的自定義屬性，用於建立SMC RPlt私鑰.";

/* X7k-fY-cFM */
"TT_SmcRevision" = "預設值:未安裝\n描述:在gEfiMiscSubClassGuid中設定REV。由VirtualSMC或FakeSMC讀取的自定義屬性，用於建立SMC REV私鑰.";

/* CdO-kb-3WH */
"TT_StartupPowerEvents" = "預設值:0\n描述:在gEfiMiscSubClassGuid中設定StartupPowerEvents。在Mac上找到的值是電源管理狀態位掩碼，通常為0. X86PlatformPlugin.kext讀取的已知位:\n•0x00000001  - 關閉原因是PWROK事件（與GEN_PMCON_2位0相同）\n•0x00000002  - 關閉原因是SYS_PWROK事件（與GEN_PMCON_2位1相同）\n•0x00000004  - 關閉原因是THRMTRIP＃事件（與GEN_PMCON_2位3相同）\n•0x00000008  - 由於SYS_RESET＃事件而重新啟動（與GEN_PMCON_2位4相同）\n•0x00000010  - 電源故障（與GEN_PMCON_3位1 PWR_FLR相同）\n•0x00000020  -  RTC電源損耗（與GEN_PMCON_3位2 RTC_PWR_STS相同）\n•0x00000040  - 通用復位狀態（與GEN_PMCON_3位9 GEN_RST_STS相同）\n•0xffffff80  -  SUS功率損耗良好（與GEN_PMCON_3位14相同）\n•0x00010000  - 喚醒原因是ME喚醒事件（與PRSTS位0相同，ME_WAKE_STS）\n•0x00020000  - 冷重啟是ME誘發事件（與PRSTS位1 ME_HRST_COLD_STS相同） •0x00040000  - 熱重啟是ME誘發事件（與PRSTS位2 ME相同_HRST_WARM_STS）•0x00080000  - 關閉是ME誘發事件（與PRSTS位3 ME_HOST_PWRDN相同）\n•0x00100000  - 全局復位ME Wachdog定時器事件（與PRSTS位6相同）\n•0x00200000  - 全局復位PowerManagment Wachdog定時器事件（與PRSTS第15位)";

/* Generic */
/* 38m-qA-it7 */
"TT_genericCheckbox_add" = "從plist\nDefault值增加或删除此部分:增加";

/* 8g1-Si-2Vs */
"TT_platformInfo_generic_SystemProductName" = "預設值:MacPro6,1\n說明:請參考SMBIOS SystemProductName.";

/* mPV-Tv-466 */
"TT_platformInfo_generic_SystemSerialNumber" = "預設值:OPENCORE_SN1\n說明:請參考SMBIOS SystemSerialNumber.";

/* jaL-um-8Nb */
"TT_platformInfo_generic_SystemUUID" = "預設值:OEM指定\n說明:請參考SMBIOS SystemUUID.";

/* rLa-T9-n6A */
"TT_platformInfo_generic_MLB" = "預設值:OPENCORE_MLB_SN11\n說明:請參考SMBIOS BoardSerialNumber.";

/* TTj-aB-3ch */
"TT_platformInfo_generic_ROM" = "<0x############> 可以是任意 6 Byte MAC 地址, 如 0x112233000000";

/* YN8-NU-Zgm */
"TT_generic_ProcessorType" = "填寫十進制整數值\n\n自動值建立會嘗試為當前安裝的CPU提供最准確的值。有關完整列表可用值及其限制(該值僅在CPU核心數量匹配時適用)是指Apple SMBIOS,可以在https://github.com/acidanthera/OpenCorePkg/blob/master/Include/Apple/IndustryStandard/AppleSmBios.h查看定義标頭\n另請參考此處以取得Mac型號上使用的CPU列表:https://docs.google.com/spreadsheets/d/1x09b5-DGh8ozNwN5ZjAi7TMnOp4TDm6DbmrKu86i_bQ\n\n例如:我的CPU是I5-6400,属於I5系列，四核心，通過查表获知CPU型號為0x0605，轉換為十進制數為1541，如果想顯示為I7處理器，對應該的CPU型號為0x0705，轉為十進制整數為1797，這裡填1797，重啟後就顯示為I7處理器";

/* PPQ-0x-9Ub */
"TT_systemMemoryStatus" = "指示系统記憶體是否可以在PlatformFeature中升級,控制“關於本機”中“記憶體”選項卡的可見性.\n\n有效值:\n• Auto — 根據機型選擇自動設定對應該的機型記憶體狀態(預設).\n• Upgradable — 設記憶體狀態為可更換模式(關於本機裡顯示記憶體標籤).\n• Soldered — 設定記憶體狀態為不可更換模式(關於本機裡不顯示記憶體標籤)\n\n注意: 在某些Mac型號上（即MacBookPro10,x和任何MacBookAir）, SPMemoryReporter.spreporter將忽略PT_FEATURE_HAS_SOLDERED_SYSTEM_MEMORY，並假定系统記憶體不可升級.";

"TT_AdviseFeatures" = "Type: plist boolean\nFailsafe: false\nDescription: Updates FirmwareFeatures with supported bits.\n\nAdded bits to FirmwareFeatures:\n• FW_FEATURE_SUPPORTS_CSM_LEGACY_MODE (0x1) - Without this bit, it is not possible to reboot to Windows installed on a drive with an EFI partition that is not the first partition on the disk.\n• FW_FEATURE_SUPPORTS_UEFI_WINDOWS_BOOT (0x20000000) - Without this bit, it is not possible to reboot to Windows installed on a drive with an EFI partition that is the first partition on the disk.\n• FW_FEATURE_SUPPORTS_APFS (0x00080000) - Without this bit, it is not possible to install macOS on an APFS disk.\n\nNote: On most newer firmwares these bits are already set, the option may be necessary when \"upgrading\" the firmware with new features.";

/* Z8Z-8r-mnL */
"TT_SpoofVendor" = "選YES (仿冒製造商為 Acidanthera 來避免出現衝突).";

/* bKX-Jd-g28 */
"TT_MaxBIOSVersion" = "設定BIOSVersion為9999.999.999.999.999, 在使用自動平台資訊以避免在非官方支援的macOS版本中進行BIOS更新時，建議用於舊版Mac.";

/* PlatformNVRAM */
/* IJO-Va-YDO */
"TT_platformnvramCheckbox_add" = "從plist增加或删除此部分:\n預設值:增加";

/* MpC-g9-pKJ */
"TT_BID" = "指定NVRAM變量4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14:HW_BID的值.";

/* L5e-wR-9li */
"TT_platformInfo_platformnvram_MLB" = "預設值:未安裝\n說明:指定NVRAM變量的值4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14:HW_MLB和4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14:MLB";

/* yhE-PH-xkY */
"TT_platformInfo_platformnvram_ROM" = "預設值:未安裝\n說明:指定NVRAM變量的值4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14:HW_ROM和4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14:ROM";

/* L5k-Nq-H9Z */
"TT_FirmwareFeatures" = "預設值:未安裝\n描述:此變量與FirmwareFeaturesMask配對。指定NVRAM變量的值:\n•4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14:FirmwareFeatures\n•4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14:ExtendedFirmwareFeatures";

/* 6Kd-rJ-POa */
"TT_FirmwareFeaturesMask" = "預設值:未安裝\n描述:此變量與FirmwareFeatures配對。指定NVRAM變量的值:\n•4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14:FirmwareFeaturesMask\n•4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14:ExtendedFirmwareFeaturesMask";

/* Nq6-s5-69T */
"TT_platformInfo_platformnvram_SystemUUID" = "指定僅用於引導服務的NVRAM變量4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14:system-id的值. 在Mac上找到的值等於SMBIOS SystemUUID.";

/* Bwi-9B-eFc */
"TT_platformInfo_platformnvram_SystemSerialNumber" = "指定 NVRAM 變數的值 4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14:HW_SSN 和 4D1EDE05-38C7-4A6A-9CC6-4BCCA8B38C14:SSN.";

/* Memory */
/* zev-9o-4NS */
"TT_DataWidth" = "Data Width\n指定儲存器的數據寬度(以bits為單位). DataWidth為0且TotalWidth為8表示該裝置僅用於提供8個纠錯位.";

/* hF3-5Q-b46 */
"TT_errorcorrection" = "Memory Error Correction\n指定記憶體支援的主要硬體錯誤纠正或檢測方法.\n• 0x01 — 其他\n• 0x02 — 未知\n• 0x03 — 無\n• 0x04 — 奇偶性\n• 0x05 — 單ECC\n• 0x06 — 多位ECC\n• 0x07 — CRC";

/* haT-n9-1ut */
"TT_formfactor" = "Form Factor\n指定記憶體的形式. 在Mac上，通常應該為DIMM或SODIMM.\n下面列出了常用的外形形式.\n如果CustomMemory為false，則根據Mac產品名稱自動設定此值.\n• 0x01 — 其他\n• 0x02 — 未知\n• 0x09 — DIMM\n• 0x0D — SODIMM\n• 0x0F — FB-DIMM";

/* Y4W-6h-1G9 */
"TT_MaxCapacity" = "Maximum Capacity\n指定系统支援的最大記憶體量（以字節為單位).";

/* 73U-MV-8lJ */
"TT_TotalWidth" = "Total Width\n指定記憶體的總寬度(以bits為單位),包括所有檢查或纠錯位. 如果沒有纠錯位，則此值應該等於DataWidth.";

/* w6I-Xj-IPK */
"TT_type" = "Memory Type\n指定記憶體類型。常用類型如下.\n• 0x01 — 其他\n• 0x02 — 未知\n• 0x0F — SDRAM\n• 0x12 — DDR\n• 0x13 — DDR2\n• 0x14 — DDR2 FB-DIMM\n• 0x18 — DDR3\n• 0x1A — DDR4\n• 0x1B — LPDDR\n• 0x1C — LPDDR2\n• 0x1D — LPDDR3\n• 0x1E — LPDDR4";

/* kmI-CT-lAM */
"TT_typedetail" = "Type Detail\n指定其他記憶體類型資訊.\n• Bit 0 — 保留, 設為0\n• Bit 1 — 其他\n• Bit 2 — 未知\n• Bit 7 — 同步\n• Bit 13 — 已註冊 (已Cache)\n• Bit 14 — 無Cache (未註冊)";

/* Devices */
/* GR6-98-yvG */
"TT_Devices_Table" = "1. Asset Tag\n指定此記憶體裝置的資產標籤.\n2. BankLocator\n指定記憶體裝置所在的帶有物理插槽,例如BANK 0,BANK 1.\n3.Device Locator\n指定物理插槽或記憶體所在的板卡位置,例如ChannelA-DIMM0,ChannelB-DIMM0.\n4.Manufacturer\n指定此記憶體裝置的製造商.\n5.Part Number\n指定此記憶體裝置的部件號,例如M00001-4GB.\n6.Serial Number\n指定此記憶體裝置的序列號.\n7.Size\n指定儲存裝置的大小(以MB為單位),例如2048,4096。 0表示此插槽未填充.\n8.Speed\n指定裝置的最大速度，以每秒兆传输(MT/s)為單位,例如:2400,2666,3200. 0表示未知速度.";

/* SMBIOS */
/* PHO-4O-OIP */
"TT_smbiosCheckbox_add" = "從plist增加或删除此部分\n預設值:增加";

/* p9S-yK-fiz */
"TT_smbios_ProductName" = "預設值:OEM指定\nSMBIOS:系统資訊（類型1），產品名稱\n說明:用於將裝置標記為操作系统支援的首選Mac模型。必須通過任何配置指定此值，以便以後自動建立此SMBIOS表和其他SMBIOS表及相關配置参數中的相關值。如果SystemProductName與目标操作系统不相容，則-no_compat_check引導参數可用作覆蓋。\n注意:如果SystemProductName未知，並且未指定相關字段，則應該假定預設值設定為MacPro6,1數據。可以在MacInfoPkg中找到已知產品列表.";

/* Rag-wy-fpE */
"TT_Family" = "預設值:OEM指定\nSMBIOS:系统資訊（類型1） - 系列描述:系列名稱。可能看起來像iMac Pro.";

/* gqH-S3-VMd */
"TT_systemManufacturer" = "預設值:OEM指定\nSMBIOS:系统資訊（類型1） - 製造商\n說明:特定電路板的OEM製造商。除非嚴格要求，否則不得指定。不應該包含Apple Inc.，因為這會混淆操作系统中存在的大量服務，例如韌體更新，eficheck，以及Acidanthera中開發的 Kernel 擴展，例如Lilu及其插件.";

/* J9G-p3-A50 */
"TT_SKUNumber" = "預設值:OEM指定\nSMBIOS:系统資訊（類型1） -  SKU編號\n說明:Mac Board ID（board-id）。在舊型號中可能看起來像Mac-7BA5B2D9E42DDD94或Mac-F221BEC8。有時它可能只是空的.";

/* a03-aA-XtL */
"TT_smbios_SystemSerialNumber" = "類型:plist字串\n預設值:OEM指定\nSMBIOS:系统資訊（類型1） - 序列號\n描述:定義格式的產品序列號。已知格式以macserial描述.";

/* Hjz-kh-KPV */
"TT_smbios_SystemVersion" = "預設值:OEM指定\nSMBIOS:系统資訊（類型1） - 版本\n描述:產品迭代版本號。可能看起來像1.1";

/* fux-7e-g2r */
"TT_smbios_SystemUUID" = "預設值:OEM指定\nSMBIOS:系统資訊（類型1） -  UUID\n描述:UUID是一個識別碼，設計為在時間和空間上都是唯一的。它不需要中央註冊過程.";

/* SO7-47-4Z3 */
"TT_smbios_BiosVendor" = "預設值:OEM指定\nSMBIOS:BIOS資訊（類型0） - 供應該商\n說明:BIOS供應該商。 SystemManufacturer的所有規則都適用.";

/* h4J-NQ-LcH */
"TT_smbios_BiosVersion" = "預設值:OEM指定\nSMBIOS:BIOS資訊（類型0） -  BIOS版本\n說明:韌體版本。此值將更新並参與更新传递配置和macOS版本相容性。在較舊的韌體中，此值可能類似於MM71.88Z.0234.B00.1809171422，並在BiosId.h中進行了描述。在較新的韌體中，它應該看起來像236.0.0.0.0或220.230.16.0.0（iBridge:16.16.2542.0.0,0）。從BridgeOSVersion變量讀取iBridge版本，並且僅在具有T2的mac上顯示.";

/* 6gn-IY-sd7 */
"TT_ReleaseDate" = "預設值:OEM指定\nSMBIOS:BIOS資訊（類型0） -  BIOS發布日期\n說明:韌體發布日期。與BIOSVersion相似。可能看起來像12/08/2017.";

/* YnG-4B-0S3 */
"TT_ChassisManufacturer" = "預設值:OEM指定\nSMBIOS:系统機箱或機箱（類型3） - 製造商說明:電路板製造商. SystemManufacturer的所有規則都適用.";

/* frw-3J-2Cg */
"TT_ChassisType" = "預設值:OEM指定\nSMBIOS:系统機箱或機箱（類型3） - 鍵入\n說明:機箱類型，有關詳細資訊，請參考表17  - 系统機箱或機箱類型.";

/* eGy-sp-yaM */
"TT_ChassisVersion" = "預設值:OEM指定\nSMBIOS:系统機箱或機箱（類型3） - 版本描述:應該匹配BoardProduct.";

/* gTB-8E-Nin */
"TT_Chassis_SerialNumber" = "預設值:OEM指定\nSMBIOS:系统機箱或機箱（類型3） - 版本描述:應該與SystemSerialNumber匹配.";

/* D26-kV-2wQ */
"TT_ChassisAssetTag" = "預設值:OEM指定\nSMBIOS:系统機箱或機箱（類型3） - 資產標籤號說明:機箱類型名稱。各種各樣，可能是空的或MacBook-Aluminium.";

/* mON-cg-FYL */
"TT_BoardManufacturer" = "預設值:OEM指定\nSMBIOS:底板（或模組）資訊（類型2） - 製造商描述:電路板製造商。 SystemManufacturer的所有規則都適用.";

/* X9U-bM-MRj */
"TT_BoardProduct" = "預設值:OEM指定\nSMBIOS:底板（或模組）資訊（類型2） - 產品\n說明:Mac Board ID（board-id）。在舊型號中可能看起來像Mac-7BA5B2D9E42DDD94或Mac-F221BEC8.";

/* cWR-8m-2Jn */
"TT_BoardVersion" = "預設值:OEM指定\nSMBIOS:底板（或模組）資訊（類型2） - 版本\n說明:電路板版本號。變化，可能與SystemProductName或SystemProductVersion匹配.";

/* xDD-P3-Saq */
"TT_BoardSerialNumber" = "預設值:OEM指定\nSMBIOS:底板（或模組）資訊（類型2） - 序列號\n說明:已定義格式的板序列號。已知格式以macserial描述.";

/* GJj-A4-bd9 */
"TT_BoardAssetTag" = "預設值:OEM指定\nSMBIOS:底板（或模組）資訊（類型2） - 資產標籤\n說明:資產標籤號。變化，可能是空的或Type2  - 董事會資產標籤.";

/* YgB-Sp-EZ5 */
"TT_BoardType" = "預設值:OEM指定\nSMBIOS:底板（或模組）資訊（類型2） - 板類型\n描述:0xA（主機板（包括處理器，記憶體和I / O）或0xB（處理器/記憶體）模組），請參考表15  - 底板:電路板類型以取得更多詳細資訊.";

/* aXB-A5-lJa */
"TT_LocationInChassis" = "預設值:OEM指定\nSMBIOS:底板（或模組）資訊（類型2） - 機箱中的位置說明:變化，可能為空或零件组件。";

/* 4l3-Do-kcw */
"TT_Features" = "預設值:0\nSMBIOS:APPLE_SMBIOS_TABLE_TYPE128  -  FirmwareFeatures和ExtendedFirmwareFeatures說明:64位韌體具有位掩碼。有關更多詳細資訊，請參考AppleFeatures.h。低32位與FirmwareFeatures匹配。高64位與ExtendedFirmwareFeatures匹配.";

/* ih3-wv-2Kc */
"TT_FeaturesMask" = "預設值:0\nSMBIOS:APPLE_SMBIOS_TABLE_TYPE128  -  FirmwareFeaturesMask和ExtendedFirmwareFeaturesMask描述:支援的擴展韌體功能位掩碼位。有關更多詳細資訊，請參考AppleFeatures.h。低32位與FirmwareFeaturesMask匹配。高64位與ExtendedFirmwareFeaturesMask匹配.";

/* Yog-wn-LaZ */
"TT_PlatformFeature" = "預設值:0\nSMBIOS:APPLE_SMBIOS_TABLE_TYPE133  -  PlatformFeature\n說明:平台功能位掩碼。有關更多詳細資訊，請參考AppleFeatures.h.";

/* oMm-l1-RDC */
"TT_SmcVersion" = "去蘋果官網看看你的三碼是什麼狀態，但我們是黑蘋果，嘿嘿，你懂得!";

/* RLW-Hz-QKb */
"TT_smbios_ProcessorType" = "預設值:自動\nSMBIOS:APPLE_SMBIOS_TABLE_TYPE131  -  ProcessorType描述:處理器主要和次要類型的组合.";

/* uefiController */
/* APFS */
/* 8Sc-F2-ONI */
"TT_EnableJumpstart" = "載入嵌入式APFS驅動程式.\n此選項替代之前使用的ApfsDriverLoader.efi驅動文件，變為OC嵌入式驅動！";

/* H5Y-DY-WOe */
"TT_GlobalConnect" = "在APFS載入期間執行完整的裝置連接。\n代替通常用於APFS驅動程式載入的分區句柄連接，每個句柄都是遞規連接的。\n這可能比平時花費更多的時間，但可能是存取某些韌體（如舊版HP筆記型電腦上的韌體）上的APFS分區的唯一方法。";

/* HdB-KO-x50 */
"TT_HideVerbose" = "隱藏APFS驅動程式載入時的詳細輸出.\nAPFS詳細輸出可用於 Debug .";

/* kSG-eA-B2o */
"TT_JumpstartHotPlug" = "為新連接的裝置載入APFS驅動程式.\n不僅在OpenCore啟動時而且在啟動選擇器(開機選單)期間載入APFS驅動程式. 這允許APFS檔案系統的USB磁區熱插拔。如果不需要則停用.";

/* L9i-6i-Mis */
"TT_MinDate" = "允許的最小APFS驅動程式日期.\n較早版本的APFS驅動程式可能包含未修補的漏洞，可用來對您的電腦造成傷害. 此選項允許將APFS驅動程式限制為僅最新版本.\n• 0 — 需要OpenCore中APFS的預設支援發布日期. 預設發布日期會随著時間增加，因此建議使用此設定. 當前設定為2021/01/01.\n• -1 — 允許載入任何發布日期（強烈建議）.\n• Other — 使用自定義的最低APFS發布日期，例如2020/04/01寫成20200401. APFS發行日期可以在OpenCore引導日誌和OcApfsLib中找到.";

/* TYZ-jG-lfr */
"TT_MinVersion" = "允許的最低APFS驅動程式版本.\nAPFS驅動程式版本將APFS驅動程式與macOS版本連接. 較早的macOS版本的APFS驅動程式將不再受支援，因此可能包含未修補的漏洞，這些漏洞可用於對您的電腦造成損害. 此選項允許將APFS驅動程式限制為僅現代macOS版本.\n• 0 — 需要OpenCore中預設支援的APFS版本. 預設版本會随著時間增加，因此建議使用此設定. 當前設定為High Sierra的最新版本.\n• -1 — 允許載入任何版本(強烈建議不要這樣做).\n• Other — 使用自定義的最低APFS版本, 例如來自macOS Catalina 10.15.4的1412101001000000. 可以在OpenCore引導日誌和OcApfsLib中找到APFS版本.";

/* AppleInput */
/* frr-qu-WDh */
"TT_appleEvent" = "確定是否使用OC內建或OEM Apple Event協議.\n\n此選項確定是否使用Apple的OEM Apple事件協議(如果有),或者是否使用了OpenCore的反向工程和更新的重新實現. 通常，應該首選OpenCore的重新實現, 因為它包含更新，例如明顯改善了滑鼠游標的精細移動和可配置的按鍵重複延遲.\n• Auto — 自動選擇實現. 由於用於實現快速啟動時間的最佳化, 實際上，這意味著將找到並使用OpenCore重新實現，除非從Apple的啟動選擇器(如果有)中明確選擇並啟動了OpenCore(不僅僅是自動啟動).\n• Builtin — 使用OpenCore更新的Apple Event協議重新實現(推薦).\n• OEM — 假設在驅動程序連接時可以使用Apple的協議. 這樣一來，Apple的實施就可以在Apple系統上可靠地使用. 否則將不支援鍵盤或滑鼠.";

/* xpZ-sA-YNw */
"TT_CustomDelays_checkbox" = "使用 Apple Event 協議的 OpenCore 實施時啟用自訂按鍵重複延遲. 使用 OEM Apple實施時無效 (請參閱 AppleEvent 設定).\n\n• true — 使用 KeyInitialDelay 和 KeySubsequentDelay 的值.\n• false — 蘋果使用(50)500ms和(5)50ms的預設值.";

"TT_GraphicsInputMirroring" = "Type: plist boolean\nFailsafe: false\nDescription: Apple’s own implementation of AppleEvent prevents keyboard input during graphics applications from appearing on the basic console input stream.\n\nWith the default setting of false, OC's builtin implementation of AppleEvent replicates this behaviour.\n\nOn non-Apple hardware this can stop keyboard input working in graphics-based applications such as Windows BitLocker which use non-Apple key input methods.\n\nThe recommended setting on all hardware is true.\n\nNote: AppleEvent's default behaviour is intended to prevent unwanted queued keystrokes from appearing after exiting graphics-based UEFI applications; this issue is already handled separately within OpenCore.\n\n• True --- Allow keyboard input to reach graphics mode apps which are not using Apple input protocols.\n• False --- Prevent key input mirroring to non-Apple protocols when in graphics mode.";

/* Kmw-jC-ANj */
"TT_customDelays" = "啟用自訂按鍵重複延遲.\n• 如果在KeySupport為true時將Auto視為Enabled，否則將Disabled.\n• 如果啟用，則使用值KeyInitialDelay和KeySubsequentDelay.\n• 如果已停用Apple使用500ms(50)和50ms(5)的預設值";

/* LPe-Zp-8MC */
"TT_KeyInitialDelay" = "0 (無初始延遲，立刻重複)\n在Apple Event協議的OpenCore實施中配置原始鍵盤重複延遲, 以10ms為單位.\n\n不使用KeySupport時,此選項將按預期配置在按鍵重複之前的初始延遲. Apple OEM預設值是50(500ms).\n\n使用KeySupport時, 您可能會發現在正常速度鍵重複開始之前，您又得到了一個慢速鍵重複. 如果是這樣，則您的初始按鍵重複延遲是由您的BIOS韌體驅動的，並且無法被OC覆蓋. 為了避免這種輕微的不良影響, 將KeyInitialDelay設定為0. 如果這樣做, 避免對單個按鍵的多次回應, 您應該將KeySubsequentDelay至少設定為KeyForgetThreshold設定的值.";

/* Op9-Rz-IAN */
"TT_KeySubsequentDelay" = "在Apple Event協議的OpenCore實施中配置後續鍵盤重複延遲, 以10ms為單位.\n\n配置按鍵重複之間的間隔. Apple OEM預設值為5(50毫秒). 0是此選項的無效值.\n\n使用KeySupport時, 您可能會發現在正常速度鍵重複開始之前，您又得到了一個慢速鍵重複.如果是這樣，請將KeyInitialDelay設定為0，然後將此選項至少設定為KeyForgetThreshold設定的值. (萬一仍然經常或偶爾出現, 完成此操作後，雙鍵回應, 繼續將此值設定為比KeyForgetThreshold大一或兩個 -使用有效的最低值.)";

/* maU-fq-8kE */
"TT_PointerSpeedDiv" = "在Apple Event 協議的 OpenCore 實施中建立指針速度除數。\n\n建立除數以進行指針移動。 Apple OEM 預設值是1.0是該選項的無效值。";

/* TSX-3o-2jP */
"TT_PointerSpeedMul" = "在Apple Event協議的OpenCore實現中配置指針速度倍增器. \n\n配置加倍以進行指針移動. Apple OEM預設值為1.";

/* Audio */
/* YTE-Ba-80O */
"TT_AudioDevice" = "用於音訊功能支援的指定音訊控制器的裝置路徑。\n通常，它包含內建的模擬音訊控制器（HDEF）裝置路徑, 比如:PciRoot(0x0)/Pci(0x1b,0x0).\n可以在 Debug 日誌中找到音訊控制器的列表:\nOCAU: 1/3 PciRoot(0x0)/Pci(0x1,0x0)/Pci(0x0,0x1)/VenMsg(<redacted>,00000000) (4 outputs)\nOCAU: 2/3 PciRoot(0x0)/Pci(0x3,0x0)/VenMsg(<redacted>,00000000) (1 outputs)\nOCAU: 3/3 PciRoot(0x0)/Pci(0x1B,0x0)/VenMsg(<redacted>,02000000) (7 outputs)\n\n也可以在macOS中使用gfxutil -f HDEF命令取得或者用Hackintool工具查看音訊裝置地址。指定空的裝置路徑將導致使用第一個可用的音訊控制器.";

/* AZW-9D-hq6 */
"TT_AudioCodec" = "用於音訊支援的指定音訊控制器上的編解碼器地址。通常，它包含內建模擬音訊控制器（HDEF）上的第一個音訊編解碼器地址。音訊編解碼器地址，例如2，可以在 Debug 日誌中找到：\nOCAU: 1/3 PciRoot(0x0)/Pci(0x1,0x0)/Pci(0x0,0x1)/VenMsg(<redacted>,00000000) (4 outputs) \nOCAU: 2/3 PciRoot(0x0)/Pci(0x3,0x0)/VenMsg(<redacted>,00000000) (1 outputs)\nOCAU: 3/3 PciRoot(0x0)/Pci(0x1B,0x0)/VenMsg(<redacted>,02000000) (7 outputs)\n\n或者，可以從I/O登錄檔軟體中的IOHDACodecDevice類取得此值，該類包含在IOHDACodecAddress字段中。";

/* UrW-oc-0Oc */
"TT_AudioOut" = "指定編解碼器輸出端口的索引，一般從0開始.\n\n找到正確端口的最快方法是將值從0暴力嘗試到N-1，N是在日誌裡顯示的輸出端口索引數，比如日誌裡顯示有3個輸出，可以從0-2一個一個試.";

/* PF5-bc-9Z2 */
"TT_MinimumVolume" = "最小音量從0到100.\n\n當計算出的音量級别小於MinimumVolume時，螢幕閱讀器將使用此音量級别。如果計算出的音量小於MinimumVolume，則不會發出開機提示音。";

/* rNr-97-fnH */
"TT_VolumeAmplifier" = "系統音量到原始音量線性轉換的倍數，範圍是0到1000。\n\n\n注意：macOS中使用的轉換不是線性的，但是非常接近，因此細微差别被忽略了.";

/* jGE-sP-Rtr */
"TT_SetupDelay" = "音訊編解碼器重新配置延遲(以微秒為單位).\n\n某些編解碼器在重新配置後需要特定於供應該商的延遲(例如，音量設定). 此選項使其可配置。通常，必要的延遲可能長達0.5秒.";

/* 77y-Lm-hgl */
"TT_playchime" = "在啟動時播放提示音Duang.\n\n啟用此設定可通過內建音訊支援播放啟動鈴聲。音量級别由MinimumVolume和VolumeAmplifier設定以及SystemAudioVolume NVRAM變量確定。設定值包括:\n• Auto — 當StartupMute NVRAM變量不存在或設定為00時啟用提示音.\n• Enabled — 無條件啟用鈴聲.\n• Disabled — 無條件停用提示音.\n\n注意：Enabled可以與StartupMute NVRAM變量分開使用，以避免和BIOS播放啟動鈴聲時發生衝突.";

/* 2zI-kW-5dk */
"TT_AudioSupport" = "通過連接到後端驅動程式來啟用音訊支援(需要增加AudioDxe.efi驅動程式)。\n\n啟用此設定會將音訊播放從內建協議路由到位於音訊控制器（AudioDevice）上的指定編解碼器（AudioCodec）的專用音訊端口（AudioOut）。";

/* 4mo-Ut-bYl */
"TT_ResetTrafficClass" = "將HDA流量等級選擇寄存器設定為TC0.\n\n僅當TCSEL寄存器配置為使用TC0流量等級時，AppleHDA kext才能正常執行. 有關此寄存器的更多詳細資訊，請參考 Intel I/O控制器9(ICH9)數據表(或任何其他ICH數據表).\n\n注意:此選項獨立於AudioSupport。 如果使用AppleALC，則最好改用AppleALC alctsel屬性.";

/* Drivers */
/* 6zo-Jl-Ryl */
"TT_uefi_driversTable" = "1. Path\nType: plist string\nFailsafe: Empty\nDescription: Path of file to be loaded as a UEFI driver from OC/Drivers directory.\n2. Enabled\nType: plist boolean\nFailsafe: false\nDescription: If false this driver entry will be ignored.\n3. Arguments\nType: plist string\nFailsafe: Empty\nDescription: Some OC plugins accept optional additional arguments which may be specified as a string here.";

/* 9f0-xd-rhT */
"TT_ConnectDrivers" = "驅動程式載入後執行UEFI控制器連接。此選項對於載入檔案系統驅動程式很有用，該檔案系統驅動程式通常遵循UEFI驅動程式模型，並且可能無法自行啟動。雖然有效，但此選項對於執行自動連接的驅動程式可能不是必需的，並且可能會稍微减慢啟動速度。";

/* Input */
/* xNH-9V-3kd */
"TT_KeyForgetThreshold" = "按住按鍵後每個鍵之間的時間間隔 (單位: 毫秒)\n此選項允許根據您的平台設定此逾時。 在大多數平台上均可使用的建議值為5毫秒。 作為参考，在VMware上按住一個鍵大约每2毫秒重複一次，而APTIO V的相同值是3-4毫秒。 因此，可以在較快的平台上設定稍低的值，而在較慢的平台上設定稍高的值，以提高回應速度。";

/* TTL-Rn-Avg */
"TT_KeySupportMode" = "Auto:鍵值轉換協議模式\nV1: UEFI 舊版輸入協議\nV2: UEFI 新輸入協議\nAMI: APTIO 輸入協議";

/* 3mi-sh-qNa */
"TT_PointerSupportMode" = "一般留空\n它使用了某些Z87和Z97 ASUS主機板上可用的專用協議。";

/* fda-QM-Vl4 */
"TT_TimerResolution" = "韌體時鐘刷新的頻率 (單位: 100纳秒)\n華碩主機板為自己的界面使用 60000\n蘋果使用 100000";

/* rxJ-TB-rJc */
"TT_KeyFiltering" = "啟用鍵盤輸入的完整性檢查。";

/* 4fK-xq-9AN */
"TT_KeySupport" = "開啟 OC 的內建鍵盤支援,部分筆記型電腦在開機選單界面無法使用鍵盤，請選擇它！\n如果使用 AppleUsbKbdxe.efi 請設定為 NO";

/* EIc-ff-Thn */
"TT_KeySwap" = "交換 Command 和 Option 鍵,一般選 NO";

/* dzp-p6-AHb */
"TT_PointerSupport" = "如果你是華碩的Z87或者Z97，你需要打開PointerSupport這個選項。";

/* Output */
/* lye-vu-fi3 */
"TT_ConsoleMode" = "設定為空字串不更改控制台模式.設定為Max以嘗試使用最大可用控制台模式.\n大多數情況下都選擇留空！";

/* mlh-hW-OqT */
"TT_textrender" = "為通過標準控制台輸出的文字選擇渲染器。\n目前支援兩個渲染器: Builtin 和 System. System渲染器使用主機板韌體自帶文字渲染進行文字渲染。 Builtin則繞過韌體服務，使用 OpenCore 內建文字渲染執行文字渲染。 不同的渲染器支援不同的選項集。建議使用內建渲染器，因為它支援HiDPI模式並使用全螢幕解析度。\n選項内容是文字渲染器和渲染模式的组合:\n• BuiltinGraphics — 使用 OpenCore 內建文字渲染的圖形模式, 並同時啟用 OpenCore 自帶的控制台管理, 支援 HIDPI 和全螢幕範圍顯示, 通常效果勝於下面的選項。\n• SystemGraphics — 使用主機板韌體自帶文字渲染的圖形模式, 並同時啟用 OpenCore 自帶的控制台管理。\n• SystemText — 使用主機板韌體自帶文字渲染的文字模式, 並同時啟用 OpenCore 自帶的控制台管理。\n• SystemGeneric — 使用主機板韌體自帶文字渲染的文字模式和自帶的控制台管理。\nBuiltinGraphics的使用通常很简單。對於大多數平台，必須啟用ProvideConsoleGop，將解析度選項設定為Max，並選擇配置Scale。\n系統協議的使用更加複雜。通常，首選設定是SystemGraphics或SystemText。啟用ProvideConsoleGop，將“解析度”設定為“最大”，啟用“ReplaceTabWithSpace”在幾乎所有平台上都很有用。 SanitiseClearScreen，IgnoreTextInGraphics和ClearScreenOnModeSwitch更具體，它們的使用取決於韌體。\n\n注意:某些Mac機型，比如MacPro5,1，可能在較新的GPU上的控制台輸出已損壞，因此只有BuiltinGraphics可以為它們工作。";

/* hVw-xH-z40 */
"TT_Resolution" = "設定控制台輸出螢幕解析度.\n•設定為空不更改螢幕解析度.\n•設定為Max以嘗試使用最大的可用螢幕解析度。\n注意:如果控制台句柄沒有GOP協議，這將失敗，可以將ProvideConsoleGop設定為true進行增加。";

"TT_ClearScreenOnModeSwitch" = "圖形模式切換到文字模式時，某些韌體僅清除螢幕的一部分，使先前绘制的圖像片段可見。 此選項在切換到文字模式之前用黑色填充整個圖形螢幕。\n注意:此選項僅適用於系統渲染器才能起作用。";

"TT_DirectGopRendering" = "使用內建的圖形輸出協議渲染器作為控制台。\n在某些韌體上，這可能會提供更好的性能，甚至修復渲染問題，但是通常建議除非有顯著的好處，否則不要使用此選項。";

"TT_IgnoreTextInGraphics" = "修復不用 -v 開機時在蘋果標誌上覆蓋有輸出日誌的問題.";

"TT_ProvideConsoleGop" = "macOS 引導載入程式要求 GOP (圖形輸出協議) 存在於控制台句柄上\n大部分的筆電都不提供 GOP, 桌機的獨立顯示卡可以單獨刷入 GOP\n如果選擇了囉嗦模式啟動之後不出現Verbose詳細資訊，請啟用此項\n開啟此選項能最大可能保證 OpenCore UI 和 蘋果標誌 以正確解析度顯示";

"TT_ReconnectOnResChange" = "有些韌體在 GOP 解析度改變後要求重新連接控制器才能輸出文字, 開啟這個選項會導致從 UEFI Shell 中啟動 OpenCore 時直接黑畫面, 盡量避免開啟。\n如果你遇到開機直到登入界面之前一直是黑畫面，請試試選擇 YES.";

"TT_ReplaceTabWithSpace" = "某些韌體無法列印制表符，甚至不能列印制表符之後的所有内容，從而導致困難或無法使用UEFI Shell內建的文字編輯器來編輯屬性列表和其他文件。 此選項使控制台輸出空間代替制表符。\n注意:此選項僅適用於系統渲染器才能起作用.";

"TT_SanitiseClearScreen" = "當使用大顯示（例如2K或4K）時，某些韌體會將螢幕解析度重置為故障安全值（如1024x768），以清除螢幕内容。此選項嘗試應用變通方法。\n注意:需要將TextRenderer設定為系統渲染模式才能使其生效。在所有已知的受影響系統上，必須將ConsoleMode設定為空字串才能使其生效.";

"TT_UgaPassThrough" = "在GOP協議的基礎上提供UGA協議實例。\n\n某些韌體未實現舊版UGA協議，但較早的EFI應用程式（如10.4版以上的EfiBoot）可能需要螢幕輸出.";

"TT_ForceResolution" = "在預設情況下無法使用所需解析度的情況下，強制設定解析度\n如舊版Intel GMA和第一代Intel HD Graphics(Ironlake/Arrandale).將解析度設定為 Max會嘗試從連接的顯示器的EDID中取得最大的可用解析度.";

"TT_GopPassThrough" = "在UGA協議實例之上提供GOP協議實例.\n\n該選項支援的值如下:\n• Enabled — 為所有UGA協議提供GOP.\n• Apple — 為啟用了AppleFramebufferInfo的協議提供GOP.\n• Disabled — 不提供GOP.\n\n此選項透過基於UGA的代理為未實現協議的韌體提供GOP協議.\n\n注意：此選項要求啟用ProvideConsoleGop.";

/* ProtocolOverrides */
"TT_AppleAudio" = "重新安裝具有內建版本的Apple音訊協議。\nApple音訊協議允許macOS引導程式和OpenCore播放聲音和訊號以進行螢幕閱讀或聲音錯誤報告。\n支援的協議是蜂鳴聲建立和VoiceOver。 在macOS High Sierra（10.13）之前不受支援。相反，較早的macOS版本使用AppleHDA協議，該協議目前尚未實現。\n\n要在實現某些協議的Mac系統上的OpenCore使用者界面中取得音訊播放，應該啟用此設定。\n\n注意：需要在UEFI-->Audio部分中配置後端音訊驅動程式，這些協議才能使用。";

"TT_AppleBootPolicy" = "用於確保虛擬機或舊白蘋果上相容 APFS，一般選擇NO。";

"TT_AppleEg2Info" = "用内內建版本替換 Apple EFI Graphics 2協議。\n\n注意：此協議允許更新的 EfiBoot 版本（至少10.15）將螢幕畫面旋轉顯示给 macOS。 有關如何設定螢幕旋轉角度，請參考 forceDisplayRotationInEFI 變數說明。旋轉角度，請參考 forceDisplayRotationInEFI 變數說明。";

"TT_AppleDebugLog" = "重新安裝具有內建版本的Apple Debug Log協議。";

"TT_AppleFramebufferInfo" = "重新安裝具有內建版本的Apple Framebuffer Info協議。 這可用於覆蓋VM或舊版Mac上幀緩衝區資訊，以提高與舊版EfiBoot的相容性，例如macOS 10.4中的版本。";

"TT_AppleImageConversion" = "重建apple圖示，一般選擇NO。";

"TT_AppleImg4Verification" = "重新安裝具有內建版本的Apple IMG4 Verification協議。 此協議用於驗證Apple Secure Boot使用的im4m清單文件。";

"TT_AppleKeyMap" = "重建蘋果功能鍵，選擇NO。";

"TT_AppleRtcRam" = "重新安裝具有內建版本的Apple RTC RAM協議。\n\n注意：Apple RTC RAM協議的內建版本可能會過滤掉選擇RTC記憶體地址的I/O嘗試。 \n地址列表可以在4D1FDA02-38C7-4A6A-9CC6-4BCCA8B30102：rtc-blacklist變量中指定為數據數组。";

"TT_AppleSecureBoot" = "重新安裝具有內建版本的Apple Secure Boot協議。";

"TT_AppleSmcIo" = "最新版本已經內建VirtualSmc.efi協議。\n使用此選項可以删除drivers目錄下的VirtualSmc.efi文件。\n但是，如果使用FakeSMC Kernel 擴展，則可能需要手動增加NVRAM私鑰變量。";

"TT_AppleUserInterfaceTheme" = "使用內建版本重新安裝Apple使用者界面主題協議。";

"TT_DataHub" = "重建datahub，這裡選NO。";

"TT_DeviceProperties" = "一般選NO\n確保在 VM 或舊白蘋果上完全相容。";

"TT_FirmwareVolume" = "一般選NO。\n修復 Filevault 的 UI 問題, 設定為 YES 可以取得更好地相容 FileVault";

"TT_HashServices" = "一般選NO。\n修復執行FileVault時滑鼠游標大小不正確的問題, 設定為 YES 可以更好地相容FileVault";

"TT_OSInfo" = "強制使用內建版本重新安裝OS Info協議。該協議通常用於從macOS引導程式，韌體或其他應用程式接收通知\n暂時沒什麼用，選擇NO.";

"TT_UnicodeCollation" = "一般選 NO。\n一些較舊的韌體破壞了 Unicode 排序規則, 設定為 YES 可以修復這些系統上 UEFI Shell 的相容性 (通常為用於 IvyBridge 或更舊的裝置)";

/* ReservedMemory */
/* hs4-gm-1Ct */
"TT_uefi_reservedMemoryTable" = "1. 地址\n保留記憶體區域的起始地址，應該將其分配為保留地址，以有效地標記操作系統無法存取的這種類型的記憶體。\n此處寫入的地址必須是記憶體映射的一部分，具有EfiConventionalMemory類型，並且是頁面對齊的(4 KBs)。\n2. 注釋\n用於為條目提供参考的任意ASCII字串。\n3. 大小\n保留記憶體區域的大小必須是頁面對齊的（4 KB）。\n4. 啟用\n除非設定為true，否則不會保留該區域.";

/* Quirks */
/* yXm-Kd-A6O */
"TT_ExitBootServicesDelay" = "可以繞過選定的APTIO IV韌體，即ASUS Z87-Pro上出現的\"Still waiting for root device\" 的提示資訊，特别是在使用FileVault 2時。由於某種原因，導致無法從macOS存取SATA控制器。應該在將來找到更好的方法。如果使用此，則需要設定3-5秒才可以。\n一般保持預設值 0，不要随便更改！";

/* 0un-PF-SFE */
"TT_TscSyncTimeout" = "嘗試執行具有指定逾時的TSC同步。\n該怪癖的主要目的是在執行 Debug XNU Kernel 時在某些服務器和可攜式電腦模型上啟用早期引導TSC同步。 對於 Debug Kernel，在任何kext可能導致所有其他解決方案出現問題之前，TSC必須在 Kernel 之間保持同步。逾時以微秒為單位指定，並取決於平台上存在的 Kernel 數量，建議的起始值為500000。\n這是一個實驗性的功能，只能用於上述問題。 在所有其他情況下，可能會使操作系統不稳定，因此不建議這樣做。在其他情況下，推薦的解決方案是安裝 Kernel 驅動程式，如VoodooTSCSync，TSAdjustReset或CpuTscSync。\n\n注意：該問題無法替換 Kernel 驅動程式的原因是，它無法在ACPI S3模式（睡眠喚醒）下執行，並且因為UEFI韌體提供了非常有限的多核支援，從而阻止了MSR寄存器的精確更新。";

"TT_ActivateHpetSupport" = "啟用HPET支援.\n\n諸如ICH6之類的舊主機板可能並不總是在韌體首選項中具有HPET設定，此選項嘗試強制啟用它.";

"TT_DisableSecurityPolicy" = "停用平台安全策略.\n\n注意：此設定停用韌體的各種安全功能, 以達到任何類型的安全啟動的目的.如果您使用UEFI安全啟動，請不要啟用它.";

"TT_IgnoreInvalidFlexRatio" = "某些類型的韌體（例如APTIO IV）可能在MSR_FLEX_RATIO（0x194）MSR寄存器中包含無效值. 這些值可能會導致Intel平台上的macOS引導失敗.\n\n注意：雖然該選件預計不會損害不受影響的韌體, 僅在特别需要時才建議使用它.\n如果你沒有在bios中解鎖CFG，一定要選YES";

"TT_ReleaseUsbOwnership" = "大部分的主機板都有自動釋放USB所有權的功能，我們選NO。如果你開機鍵盤滑鼠卡死了，或者USB失靈，試試選Yes.";

"TT_RequestBootVarRouting" = "啟用此項以便能夠在與 macOS 引導項設計上不相容的韌體中可靠地使用[啟動磁區]設定。\n\n提醒:一些主機板如果啟用此項，在使用resetNVRAM後會導致黑畫面無法進入BIOS的硬體損壞，必須停用此項和設定Misc-->Security-->BootProtect為None!!";

"TT_UnblockFsConnect" = "HP筆電在 OpenCore 引導界面沒有引導項時設定為 YES";

"TT_ForgeUefiSupport" = "在 EFI 1.x 韌體上實現部分 UEFI 2.x 支援.\n\n此設定允許在具有較舊 EFI 1.x 韌體（例如MacPro5,1）的硬體上運行某些為 UEFI 2.x 韌體編寫的軟體（例如NVIDIA GOP Option ROM).";

"TT_ReloadOptionRoms" = "查詢 PCI 設備並重新載入其 Option ROM (如果有).\n\n例如,通過 ForgeUefiSupport 升級韌體版本後,此選項允許在較舊的 Mac 上重新載入 Nvdia GOP Option ROM.";

"TT_EnableVectorAcceleration" = "啟用 SHA-512 和 SHA-384 哈希演算法的 AVX 向量加速。";

"TT_ForceOcWriteFlash" = "Type: plist boolean\nFailsafe: false\nDescription: Enables writing to flash memory for all OpenCore system variables.\n\nNote: This value should be disabled on most types of firmware but is left configurable to account for firmware that may have issues with volatile variable storage overflows or similar. Boot issues across multiple OSes can be observed on e.g. Lenovo Thinkpad T430 and T530 without this quirk. Apple variables related to Secure Boot and hibernation are exempt from this for security reasons. Furthermore, some OpenCore variables are exempt for different reasons, such as the boot log due to an available user option, and the TSC frequency due to timing issues. When toggling this option, a NVRAM reset may be required to ensure full functionality.";

"TT_ResizeGpuBars" = "Type: plist integer\nFailsafe: -1\nDescription: Configure GPU PCI BAR sizes.\n\nThis quirk sets GPU PCI BAR sizes as specified or chooses the largest available below the ResizeGpuBars value. The specified value follows PCI Resizable BAR spec. Use 0 for 1 MB, 1 for 2 MB, 2 for 4 MB, and so on up to 19 for 512 GB.\n\nResizable BAR technology allows to ease PCI device programming by mapping a configurable memory region, BAR, into CPU address space (e.g. VRAM to RAM) as opposed to a fixed memory region. This technology is necessary, because one cannot map the largest memory region by default, for the reasons of backwards compatibility with older hardware not supporting 64-bit BARs. Consequentially devices of the last decade use BARs up to 256 MB by default (4 remaining bits are used by other data) but generally allow resizing them to both smaller and larger powers of two (e.g. from 1 MB up to VRAM size).\n\nOperating systems targeting x86 platforms generally do not control PCI address space, letting UEFI firmware decide on the BAR addresses and sizes. This illicit practice resulted in Resizable BAR technology being unused up until 2020 despite being standardised in 2008 and becoming widely available in the hardware soon after.\n\nModern UEFI firmware allow the use of Resizable BAR technology but generally restrict the configurable options to failsafe default (OFF) and maximum available (ON). This quirk allows to fine-tune this value for testing and development purposes.\n\nConsider a GPU with 2 BARs:\n• BAR0 supports sizes from 256 MB to 8 GB. Its value is 4 GB.\n• BAR1 supports sizes from 2 MB to 256 MB. Its value is 256 MB.\n\nExample 1: Setting ResizeGpuBars to 1 GB will change BAR0 to 1 GB and leave BAR1 unchanged.\nExample 2: Setting ResizeGpuBars to 1 MB will change BAR0 to 256 MB and BAR0 to 2 MB.\nExample 3: Setting ResizeGpuBars to 16 GB will change BAR0 to 8 GB and leave BAR1 unchanged.\n\nNote 1 : This quirk shall not be used to workaround macOS limitation to address BARs over 1 GB. ResizeAppleGpuBars should be used instead.\n\nNote 2: While this quirk can increase GPU PCI BAR sizes, this will not work on most firmware as is, because the quirk does not relocate BARs in memory, and they will likely overlap. Contributions to improve this feature are welcome.";
